{
    "banana": {
        "name": "Banana (Saging)",
        "iconName": "Banana",
        "binomial": "Musa",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/nutritionsource/food-features/bananas/#:~:text=One%20serving%2C%20or%20one%20medium,fiber%2C%20and%20450%20mg%20potassium"
        },
        "preservation": {
            "plastic_wrapping": {
                "name": "Plastic Wrapping",
                "description": "Wrapping banana stems in plastic preserves their freshness by limiting exposure to ethylene gas and external factors. This simple technique extends their shelf life, ensuring they remain firm and flavorful for a longer time.",
                "ingredients": [
                    "Plastic food wrapper"
                ],
                "process": [
                    "Tear off a small piece of plastic wrap.",
                    "Gently peel the loose outer layers of the banana stem to expose its inner core.",
                    "Carefully wrap the plastic around the exposed stem, and securely fasten it.",
                    "Store the banana in in a cool, dry place away from sunlight."
                ],
                "src": "https://www.foodstoragemoms.com/the-best-ways-to-preserve-bananas/"
            },
            "refrigeration": {
                "name": "Refrigeration",
                "description": "The cool, controlled environment of a refrigerator helps preserve their firm texture and natural flavor, allowing you to enjoy them over a more extended period. This method is especially useful when you have ripe bananas and want to prevent them from becoming overly soft or mushy.",
                "ingredients": [
                    "Ripe bananas"
                ],
                "process": [
                    "Choose ripe bananas you want to preserve.",
                    "Place the bananas in the refrigerator.",
                    "Consume the bananas within a week."
                ],
                "src": "https://www.foodstoragemoms.com/the-best-ways-to-preserve-bananas/"
            },
            "freezing": {
                "name": "Freezing",
                "description": "Freezing not only halts the ripening process but also allows you to use the bananas later in smoothies, baking, or desserts. Frozen bananas maintain their natural sweetness and creamy texture, making them a versatile ingredient for various culinary delights.",
                "ingredients": [
                    "Ripe bananas"
                ],
                "process": [
                    "Choose ripe bananas you want to preserve.",
                    "Peel and slice the bananas into rounds or chunks",
                    "Place the banana slices in a single layer on a baking sheet or tray lined with parchment paper.",
                    "Place the tray inside the freezer, and let the banana slices freeze for about 2-3 hours.",
                    "After freezing up, place them in an airtight container and put them back inside the freezer."
                ],
                "src": "https://www.foodstoragemoms.com/the-best-ways-to-preserve-bananas/"
            },
            "dehydration": {
                "name": "Banana Chips",
                "description": "Dehydrated bananas, often known as banana chips, are a convenient and healthy snack option. By removing the moisture content, the bananas become shelf-stable, allowing you to enjoy them for an extended period without refrigeration.",
                "ingredients": [
                    "Ripe bananas",
                    "Lemon juice (optional)"
                ],
                "process": [
                    "Peel and slice the ripe bananas",
                    "Place the slices on your dehydrator trays",
                    "Set the dehydrator to a temperature of around 135°F (57°C).",
                    "Periodically check the banana slices for dryness.",
                    "Remove the dehydrated banana slices and allow them to cool completely before storing them in an airtight container or resealable bags."
                ],
                "src": "https://www.foodstoragemoms.com/the-best-ways-to-preserve-bananas/"
            }
        }
    },
    "calamansi": {
        "name": "Calamansi",
        "iconName": "Calamansi",
        "binomial": "Citrus × microcarpa",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "37",
            "Carbohydrates": "27g",
            "Protein": "0.8g",
            "Fat": "0.1g",
            "Calcium": "40g",
            "Phosphorus": "22g",
            "Potassium": "37g",
            "src": "https://www.fruitsinfo.com/calamansi-fruit.php"
        },
        "preservation": {
            "fermentation": {
                "name": "Burong Calamansi",
                "description": "Calamansi fermentation utilizes lactic acid bacteria to break down the sugars in the fruit, converting them into lactic acid. This fermentation process not only preserves the calamansi but also transforms its taste, resulting in a complex blend of bright citrus fragrance and punchy salty tartness.",
                "ingredients": [
                    "500 grams calamansi (green, not ripe)",
                    "50 grams sea salt (not iodized)"
                ],
                "process": [
                    "Rinse the calamansi and allow them to air dry. Meanwhile, add a layer of salt to the bottom of your jar.",
                    "When the calamansi are dry, quarter them without cutting all the way through to the base.",
                    "Fill the calamansi quarters with salt and carefully place them inside the jar, pressing gently to release their juices. Use a pestle to tamp down the limes.",
                    "Place a weight on top to keep the calamansi submerged, then seal the jar with an airtight lid.",
                    "Let the jar sit on the counter to ferment for at least 4 weeks. Occasionally, top up with extra calamansi juice to ensure the fruits remain submerged during the curing period.",
                    "When using the preserved calamansi, use a clean fork or tongs (never your hands) to remove one or more pieces from the jar. Rinse and remove the seeds and salty pulp, then use the peel according to your recipe."
                ],
                "src": "https://startersisters.com/burong-kalamansi-preserved-calamansi/"
            },
            "juice": {
                "name": "Calamansi Juice",
                "description": "Preserving calamansi by juicing involves extracting the citrus juice and preserving it to extend its shelf life and maintain its vibrant flavor.",
                "ingredients": [
                    "Fresh calamanansi"
                ],
                "process": [
                    "Prepare a bottle or container with a lid, and place a mesh strainer inside to facilitate easy removal of seeds.",
                    "Halve the calamansi fruits using a sharp knife, exposing the flesh by slicing between the stem end and the tip end.",
                    "Squeeze the fruit halves over the mesh strainer, using your fingers. Ensure to remove and discard the seeds regularly for efficient straining.",
                    "If preferred, transfer the juice to an ice cube tray and freeze. Alternatively, seal the bottle with a lid and refrigerate the juice for up to two weeks."
                ],
                "src": "https://www.yummy.ph/lessons/prepping/how-to-preserve-calamansi-a00249-20210827" 
            }
        }
    },
    "coconut": {
        "name": "Coconut (Niyog)",
        "iconName": "Coconut",
        "binomial": "Cocos nucifera",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "refrigeration": {
                "name": "Refrigeration",
                "description": "Preserve the freshness of whole coconuts by wrapping them in plastic and placing them in the refrigerator's crisper drawer. This method, lasting 2-3 weeks, slows down the natural ripening process, enhancing their shelf life. Be mindful of keeping them away from strong odors.",
                "ingredients": [
                    "Fresh whole coconuts"
                ],
                "process": [
                    "Place the whole coconut in a plastic bag or tightly wrap it in plastic wrap to prevent moisture loss.",
                    "Store the wrapped coconut in the refrigerator's crisper drawer.",
                    "Ensure that the coconut is kept away from strong-smelling foods to prevent odor absorption.",
                    "The cool temperature in the refrigerator will slow down the natural ripening process, extending the coconut's freshness for 2-3 weeks."
                ],
                "src": "https://www.savorysuitcase.com/how-to-store-coconuts/"
            },
            "freezing": {
                "name": "Freezing",
                "description": "Transform the versatile coconut into a long-lasting resource by removing husk and water, cracking them open, and carefully storing the flesh in the freezer. Once frozen, the coconut's tropical goodness remains accessible for up to six months, offering a convenient and flavorful ingredient for future recipes or spontaneous snacking.",
                "ingredients": [
                    "Fresh whole coconuts"
                ],
                "process": [
                    "Begin by removing the husk and draining the water from the whole coconuts to prepare them for freezing.",
                    "Crack open the coconut and extract the flesh. Depending on your preference, cut the flesh into small pieces or shred it.",
                    "Place the coconut pieces in an airtight container or freezer bag, ensuring a tight seal.",
                    "Place the sealed container in the freezer, where frozen coconut can remain fresh for up to six months."
                ],
                "src": "https://www.savorysuitcase.com/how-to-store-coconuts/"
            }
        }
    },
    "dragon_fruit": {
        "name": "Dragon Fruit (Pitaya)",
        "iconName": "Dragon Fruit",
        "binomial": "Hylocereus undatus",
        "type": "Fruit",
        "season": ["January", "June", "July", "August", "September", "October", "December"],
        "nutrients": {
            "Calories": "42.8",
            "Carbohydrates": "11.4g",
            "Protein": "0.27g",
            "Fat": "0.1g",
            "Sugar": "7.31g",
            "Fiber": "2.32g",
            "Calcium": "6.75mg",
            "Magnesium": "5.25mg",
            "Potassium": "87mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/2344729/nutrients"
        },
        "preservation": {
            "juice": {
                "name": "Pitaya Juice",
                "description": "Embark on a journey of vibrant flavors with homemade dragon fruit juice. Elevate your beverage game with this hydrating and visually stunning concoction.",
                "ingredients": [
                    "Fresh dragon fruits",
                    "Water",
                    "Ginger",
                    "Lime",
                    "Sweetener of your choice"
                ],
                "process": [
                    "Put the ingedients in a blender.",
                    "Blend until the juice becomes smooth.",
                    "Add and stir in the sweetener of your choice.",
                    "Serve accordingly."
                ],
                "src": "https://thatgirlcookshealthy.com/dragon-fruit-juice-recipe/"
            },
            "dehydration": {
                "name": "Dehydration",
                "description": "Preserve dragon fruit through dehydration for extended storage, as tasty snacks, and to safeguard your harvest.",
                "ingredients": [
                    "Fresh dragon fruits"
                ],
                "process": [
                    "Prior to peeling, wash the dragon fruit thoroughly to avoid transferring surface problems.",
                    "Slice the dragon fruit into 1/4-inch slices.",
                    "Dry the dragon fruit slices at 135°F / 57°C for 8-12+ hours. Place them closely on trays without the need for a liner.",
                    "Ensure the dried dragon fruit is dry to the touch, pliable but not brittle. It should bend before breaking.",
                    "Once properly dried, conditioned, and stored in an airtight container, dehydrated dragon fruit can last up to a year. Condition before storing for optimal preservation."
                ],
                "src": "https://www.thepurposefulpantry.com/dehydrate-dragon-fruit/"
            },
            "freezing": {
                "name": "Freezing",
                "description": "Preserve the exotic essence of dragon fruit through freeze-drying for extended storage.",
                "ingredients": [
                    "Fresh dragon fruits"
                ],
                "process": [
                    "Cut the dragon fruit into small, uniform pieces.",
                    "Place the dragon fruit pieces on a plate or baking sheet lined with parchment paper. Allow the dragon fruit to freeze overnight.",
                    "Transfer the frozen dragon fruit pieces into a plastic bag.",
                    "Ensure optimal freshness by removing as much air as possible from the bag."
                ],
                "src": "https://www.seedsdelmundo.com/blog/storing-dragon-fruit/"
            }
        }
    },
    "tamarind": {
        "name": "Tamarind (Sampalok)",
        "iconName": "Tamarind",
        "binomial": "Tamarindus indica",
        "type": "Fruit",
        "season": ["October", "November", "December"],
        "nutrients": {
            "Calories": "4.78",
            "Carbohydrates": "1.25g",
            "Protein": "0.056g",
            "Fat": "0.012g",
            "Sugar": "0.776g",
            "Fiber": "0.102g",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/167763/nutrients"
        },
        "preservation": {
            "paste": {
                "name": "Tamarind Paste",
                "description": "Tamarind paste, a culinary gem, is the concentrated embodiment of tamarind's tangy richness. Crafted from the velvety pulp of the tamarind pod, this versatile paste imparts a distinctive sweet and sour profile to a myriad of dishes.",
                "ingredients": [
                    "Fresh tamarinds"
                ],
                "process": [
                    "Clean the tamarind to remove any unwanted particles.",
                    "Prepare a bowl of hot water, and let the tamarinds sit on it for 45 minutes to 1 hour until the tamarind turns soft.",
                    "Squeeze off the tamarind well.",
                    "Strain the pulp, and discard stones or covering of the tamarind or seeds.",
                    "Boil the paste on a medium flame for about 4 to 5 minutes.",
                    "Cool the paste and store it in a clean container.",
                    "Refrigerate and use within a month."
                ],
                "src": "https://www.indianhealthyrecipes.com/tamarind-paste-recipe-make-tamarind-paste/"
            },
            "juice": {
                "name": "Tamarind Juice",
                "description": "Extracted from the renowned 'Indian dates,' tamarind, this juice encapsulates the tangy-sour-sweet burst that elevates dishes across various cuisines.",
                "ingredients": [
                    "160g of tamarind",
                    "2 cups of water"
                ],
                "process": [
                    "Put the tamarinds in the bowl and pout 2 cups of water.",
                    "Heat the bowl in the microwave for 1 minute until it softens, and let it cool.",
                    "Squeeze the juice out of the tamarind.",
                    "Strain the slushy mix",
                    "Add more water, press, strain, and repeat.",
                    "Discard the pulp and seeds, and transfer the juice to a pan.",
                    "Boil the juice for 1 to 2 minutes.",
                    "Reduce heat and simmer for 5 minutes until it thickens slightly.",
                    "Remove from heat and let it cool completely.",
                    "Pour into a clean container, and refrigerate. Use the juice for upto 3 months."
                ],
                "src": "https://loveisinmytummy.com/2016/08/using-and-storing-tamarind.html"
            }
        }
    },
    "cashew": {
        "name": "Cashew (Kasoy)",
        "iconName": "Cashew",
        "binomial": "Anacardium occidentale",
        "type": "Fruit",
        "season": ["February, March", "April", "May"],
        "nutrients": {
            "Calories": "53",
            "Moisture": "86.3g",
            "Carbohydrates": "11.1g",
            "Fiber": "3.2g",
            "Phosphorus": "67mg",
            "Potassium": "124mg",
            "src": "https://www.fruitsinfo.com/cashew-apple-fruit.php"
        },
        "preservation": {
            "juice": {
                "name": "Cashew Juice",
                "description": "A tropical elixir common that captures the essence of the cashew fruit.",
                "ingredients": [
                    "1 dozen cashew",
                    "2 tablespoons of condensed milk (Optional)",
                    "3 drops of vanilla extract (Optional)",
                    "1 cup of water"
                ],
                "process": [
                    "Rinse the cashew fruit and extract the nut.",
                    "Dice the fruit into cubes, taking care to avoid staining clothing.",
                    "Blend the fruit with water until smooth.",
                    "Strain the juice into a container, removing any leftover fiber.",
                    "Optionally, enhance the flavor by adding sweetened condensed milk and vanilla extract to the container. Mix thoroughly.",
                    "Serve the refreshing juice over ice."
                ],
                "src": "https://jamaicans.com/cashew-fruit-juice-recipe/"
            },
            "sauce": {
                "name": "Cashew Nut Sauce",
                "description": "Crafted from luscious cashew nuts, this sauce adds a creamy texture and a nutty undertone to both savory and sweet creations.",
                "ingredients": [
                    "2 cups of cashew",
                    "1 1/4 cup of water or broth",
                    "1-2 cloves of garlic",
                    "1 teaspoon salt"
                ],
                "process": [
                    "In a bowl, immerse cashews in water and let them soak for approximately 2 hours. Afterward, drain and rinse thoroughly.",
                    "Transfer the soaked cashews to the bowl of a food processor or blender, adding water, garlic, and salt.",
                    "Puree the ingredients until achieving an exceptionally smooth texture. Adjust consistency by adding more water if needed.",
                    "Store the resulting mixture in the refrigerator for 3-4 days, or opt for freezing for longer preservation."
                ],
                "src": "https://pinchofyum.com/five-minute-cashew-sauce"
            }
        }
    },
    "canistel": {
        "name": "Canistel (Tiesa)",
        "iconName": "Canistel",
        "binomial": "Pouteria campechiana",
        "type": "Fruit",
        "season": ["October", "November"],
        "nutrients": {
            "Calories": "140",
            "Protein": "1.7g",
            "Fat": "0.1g",
            "Carbohydrates": "37g",
            "Vitamin C": "58mg",
            "Phosphorus": "37mg",
            "src": "https://www.fruitsinfo.com/Canistel-Exotic-fruits.php#health"
        },
        "preservation": {
            "ice_cream": {
                "name": "Ice Cream",
                "description": "Indulge in the goodness of a super-easy, creamy vegan ice cream featuring canistel, passionfruit, and coconut cream. Recognized for potential health benefits, including lowering the risk of diabetes, boosting immunity, and promoting eye health due to its high vitamin A content, canistel becomes a star in this dessert. Its unexpected richness in iron also makes it an excellent choice for vegetarians and vegans.",
                "ingredients": [
                    "2 ripe canistel",
                    "5 passionfruits",
                    "200ml coconut cream",
                    "100ml non-dairy milk",
                    "0.5 cups muscovado sugar (adjust to taste)"
                ],
                "process": [
                    "Peel the ripe canistels similar to a mango, extracting and discarding the seeds.",
                    "Combine all ingredients in a blender, blending until thoroughly mixed.",
                    "Transfer the resulting mixture into a freeze-safe container and place it in the freezer.",
                    "Vigorously mix the ice cream every two hours, repeating the process three times to break up ice crystals.",
                    "Prior to serving, let the ice cream sit at room temperature for 15 minutes (adjust based on ambient temperature).",
                    "Present the dessert with additional passionfruit pulp and/or desiccated coconut for added flavor and texture."
                ],
                "src": "https://www.vforveganista.com/recipes/canistel-passionfruit-vegan-ice-cream/"
            },
            "pie": {
                "name": "Canistel Pie",
                "description": "Canistel pie, a luscious creation, blends the unique flavors of canistel with a delightful spice-infused custard.",
                "ingredients": [
                    "1 cup sugar",
                    "1 teaspoon ground cloves",
                    "1/4 teaspoon salt",
                    "3 eggs",
                    "1 1/2 cup mashed canistel",
                    "1 1/2 cup milk",
                    "1 teaspoon vanilla",
                    "1 unbaked 9-inch deep-dish pie shell"
                ],
                "process": [
                    "Preheat the oven to 425°F.",
                    "In a small dish, combine sugar, salt, and cloves.",
                    "In a large bowl, beat the eggs.",
                    "Stir in the canistel and the sugar-clove mixture into the beaten eggs.",
                    "Gradually incorporate the milk and vanilla into the mixture.",
                    "Pour the combined mixture into a pie shell.",
                    "Bake in a preheated 425°F oven for 15 minutes.",
                    "Reduce the oven temperature to 350°F and bake for approximately 30 more minutes or until the filling is firm.",
                    "Serve the pie with whipped cream."
                ],
                "src": "http://www.virtualherbarium.org/tropicalfruit/canistel-recipes.html"
            }
        }
    },
    "bilimbi": {
        "name": "Bilimbi (Kamias)",
        "iconName": "Bilimbi",
        "binomial": "Averrhoa bilimbi",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Serving size": "100g",
            "Calories": "19",
            "Carbohydrates": "3g",
            "Fiber": "1g",
            "Protein": "0g",
            "Fat": "0g",
            "Calcium": "15mg",
            "Phosphorus": "10mg",
            "Iron": "1mg",
            "src": "https://www.medindia.net/calories-in-indian-food/common_foods/fruits/bilimbi.htm"
        },
        "preservation": {
            "brine": {
                "name": "Bilimbi in Brine",
                "description": "Preserve the tangy goodness of bilimbi through pickling with this simple method.",
                "ingredients": [
                    "250g bilimbi",
                    "250ml water",
                    "1 teaspoon salt"
                ],
                "process": [
                    "Let the saltwater brine cool to room temperature.",
                    "Pour the brine over the bilimbi in the jar, ensuring it completely covers the fruit. Use the 2% formula to determine the salt required for the brine.",
                    "Seal the jar with a lid and keep it at room temperature for at least 3 days before refrigerating.",
                    "Your bilimbi pickle is now ready for consumption."
                ],
                "src": "https://simplycookingandhealth.blogspot.com/2014/02/bilimbi.html"
            },
            "wine": {
                "name": "Bilimbi Wine",
                "description": "Embark on the delightful journey of crafting bilimbi wine through a simple two-stage fermentation process.",
                "ingredients": [
                    "1/2kg bilimbi",
                    "1kg sugar",
                    "5 cups of water",
                    "1/4 teaspoon yeast"
                ],
                "process": [
                    "Boil bilimbi, sugar, and water in a bowl, allowing it to cool by 30 degrees before adding yeast.",
                    "Once completely cooled, transfer the mixture into a clean bottle, sealing it with an airtight cap for the initial 20-day primary fermentation in a cool, dry place.",
                    "After 20 days, strain the wine using fine cloth, transferring it to an airtight container for the secondary fermentation, another 20-day process.",
                    "Siphon the wine into a new bottle, leaving excess yeast and must behind. This racking process, vital for eliminating a yeasty flavor, should be performed twice, with the option for further improvement in taste with additional rackings."
                ],
                "src": "https://simplycookingandhealth.blogspot.com/2014/02/bilimbi.html"
            }
        }
    },
    "carambola": {
        "name": "Carambola/Star Fruit (Balingbing)",
        "iconName": "Carambola",
        "binomial": "Averrhoa carambola",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "21.7",
            "Carbohydrates": "4.71g",
            "Protein": "0.728g",
            "Fat": "0.231g",
            "Sugar": "2.79g",
            "Fiber": "1.96g",
            "Potassium": "93.1mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/171715/nutrients"
        },
        "preservation": {
            "juice": {
                "name": "Carambola Juice",
                "description": "Star fruit is perfect for juicing! Whether enjoyed on its own or blended with other fruits, star fruit juice is a delicious and nutritious option. Packed with vitamin C and various beneficial nutrients, it offers a healthy and refreshing choice for your juice regimen.",
                "ingredients": [
                    "1.77kg star fruit",
                    "37g ginger",
                    "199g brown sugar",
                    "1 tablespoon lime juice",
                    "1.16L water"
                ],
                "process": [
                    "Cleanse the star fruit and ginger to eliminate any dirt, then chop them into smaller pieces.",
                    "Place the ginger and star fruit in a blender along with water, blending until a smooth consistency is achieved. Depending on your blender's size, you may need to blend in multiple batches.",
                    "Use a sieve or cheesecloth to strain the mixture, with cheesecloth being the preferred option for a neater process.",
                    "Introduce lime juice and sweeten the mixture with sugar to taste.",
                    "Refrigerate or serve over a generous amount of ice."
                ],
                "src": "https://jamaicanfoodsandrecipes.com/star-fruit-juice-recipe/"
            },
            "jam": {
                "name": "Carambola Jam",
                "description": "Indulge in the exquisite essence of star fruit with this delightful preserve. Ideal for spreading on toast, enhancing desserts, or elevating your culinary creations with a taste of the tropics.",
                "ingredients": [
                    "2 star fruits",
                    "1 lemon",
                    "1 cup of sugar",
                    "1 cup of water"
                ],
                "process": [
                    "Cut star fruit into thick horizontal slices.",
                    "Combine half of the sugar with water and bring it to a boil with the fruit.",
                    "Cook until the fruit becomes tender. Drain the fruit, reserving the liquid.",
                    "Mix the remaining sugar with the saved liquid.",
                    "Bring the mixture to a boil until it reaches a 1-thread consistency.",
                    "Reintroduce lemon juice and the fruit into the syrup.",
                    "Boil for an additional 2-3 minutes.",
                    "Remove from heat, let it cool, and bottle it in a sterile jar.",
                    "Seal the jar with a non-metallic airtight lid."
                ],
                "src": "https://www.bawarchi.com/recipe/star-fruit-preserve-oerttbfehehji.html"
            }
        }
    },
    "lemon": {
        "name": "Lemon",
        "iconName": "Lemon",
        "binomial": "Citrus limon",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "24.4",
            "Protein": "0.924g",
            "Fat": "0.252g",
            "Carbohydrates": "7.83g",
            "Fiber": "2.35g",
            "Sugar": "2.1g",
            "Calcium": "21.8mg",
            "Potassium": "116mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/167746/nutrients"
        },
        "preservation": {
            "juice": {
                "name": "Lemon Juice",
                "description": "Discover a healthful, revitalizing, and freshly made homemade lemon juice recipe. This easy and swift lemonade recipe guides you through creating a refreshing lemon drink from scratch.",
                "ingredients": [
                    "Lemons",
                    "Water",
                    "Sugar (Optional)"
                ],
                "process": [
                    "Roll the lemons on the worktop in a circular motion or between your palms to make them easier to juice.",
                    "Cut each lemon into two equal parts and juice them.",
                    "Pour the freshly squeezed lemon juice into a pitcher and add 2 liters of cold water.",
                    "Optionally, add sliced lemons and sugar to the pitcher.",
                    "Stir the contents well.",
                    "Place the pitcher in the fridge to chill, or serve immediately over ice."
                ],
                "src": "https://www.recipevibes.com/lemon-juice-recipe/"
            },
            "marmalade": {
                "name": "Lemon Marmalade",
                "description": "Lemon marmalade is a delightful spread that captures the essence of fresh lemons in every spoonful. With a perfect balance of sweetness and zesty citrus notes, this vibrant marmalade adds a burst of flavor to your morning toast or enhances a variety of culinary creations.",
                "ingredients": [
                    "1kg unwaxed lemon",
                    "2kg granulated sugar"
                ],
                "process": [
                    "Chill a saucer in the freezer for checking the jam's setting point.",
                    "Wash the lemons, remove the top 'button,' and place them in a large saucepan with 2.5 liters of water. Boil, cover, and simmer for 2½ hours until the lemon skins are tender.",
                    "After cooling, measure 1.5 liters of the cooking liquid. Halve the lemons, remove the pips, and cut the peel and flesh into strips. Tie the pips in muslin.",
                    "Return all ingredients, including reserved juices and muslin bag, to the pan. Add sugar, bring to a boil, and stir until dissolved. Boil rapidly for 20 minutes until setting point is reached.",
                    "Test setting point on a chilled saucer. Cool and push gently; if it crinkles, it's ready. Let it cool for 10-15 minutes, remove the muslin bag, stir, and pour into warm sterilized jars. Seal immediately."
                ],
                "src": "https://www.bbcgoodfood.com/recipes/lemon-marmalade"
            },
            "limoncello": {
                "name": "Limoncello",
                "description": "Made from the zest of lemons, it captures the essence of the Amalfi Coast in every sip. Enjoyed as a digestif, this citrus-infused liqueur brings a burst of Mediterranean sunshine to your palate, making it a delightful and invigorating treat.",
                "ingredients": [
                    "10 organic lemons",
                    "1 750-ml vodka (100-proof preferred, or 80-proof)",
                    "1 to 4 cups of sugar, to taste"
                ],
                "process": [
                    "Use a vegetable peeler to remove the outer yellow skin of all the lemons, minimizing pith. Trim away large pieces of pith with a paring knife.",
                    "Transfer lemon peels to a 1-quart jar and cover with vodka. Seal with the lid.",
                    "Allow vodka and lemon peels to infuse in a shaded area for at least 4 days, up to a month, for a more intense lemon flavor.",
                    "Line a strainer with a coffee filter and strain the infused vodka into a 4-cup measuring cup. Stir if necessary.",
                    "Make sugar syrup by dissolving 1 cup of sugar in 1 cup of simmering water. Adjust ratios for desired sweetness.",
                    "Pour sugar syrup into the infused vodka, stirring gently. Taste and add more sugar syrup if needed.",
                    "Using a funnel, fill bottles with the limoncello mixture.",
                    "Refrigerate or freeze the limoncello for at least 4 hours before serving. It can be stored in the fridge for up to a month or the freezer for up to a year."
                ],
                "src": "https://www.thekitchn.com/how-to-make-limoncello-cooking-lessons-from-the-kitchn-197694"
            },
            "pickle": {
                "name": "Lemon Pickle",
                "description": "Lemon pickle is a delightful and flavorful condiment from the Middle East that is incredibly delicious!",
                "ingredients": [
                    "Lemons",
                    "Red chili peppers",
                    "Salt",
                    "Sugar",
                    "Paprika",
                    "Turmeric",
                    "Cumin"
                ],
                "process": [
                    "Clean, slice, and juice the lemons.",
                    "After slicing, place the lemons in a glass bowl, and keep the lemon juice in a separate glass bowl. Ensure the container is non-reactive, like glass, to avoid acid reactions.",
                    "Mix lemon juice and chili pepper in a glass bowl using a mortar and pestle. Alternatively, substitute chili pepper with a teaspoon of shatta sauce.",
                    "Using your hands, massage the chili paste into the sliced lemons.",
                    "Add the seasoned lemon slices and any accumulated juices to a sterilized glass jar.",
                    "Let the lemon pickle sit for up to 8 hours before use. During this time, store it in a sterilized jar with a tight-fitting lid."
                ],
                "src": "https://silkroadrecipes.com/lemon-pickle/"
            }
        }
    },
    "orange": {
        "name": "Orange",
        "iconName": "Orange",
        "binomial": "Citrus sinensis",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "61.6",
            "Protein": "1.23g",
            "Fat": "0.157g",
            "Carbohydrates": "15.5g",
            "Fiber": "3.14g",
            "Sugar": "12.2g",
            "Calcium": "52.4mg",
            "Magnesium": "13.1mg",
            "Phosphorus": "18.3mg",
            "Potassium": "237mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/169097/nutrients"
        },
        "preservation": {
            "dehydration": {
                "name": "Dehydrated Citrus",
                "description": "Experience the vibrant burst of sunshine captured in dehydrated oranges. Slice, dehydrate, and savor the concentrated citrus goodness.",
                "ingredients": [
                    "Oranges",
                    "Limes",
                    "Lemons"
                ],
                "process": [
                    "Wash oranges and other citrus fruits thoroughly, then dry.",
                    "Cut all citrus into 1/4-inch slices.",
                    "Preheat the oven to 200°F.",
                    "Place citrus slices in a single layer on a cooling rack atop a sheet pan.",
                    "Allow citrus to dehydrate in the oven for 3-4 hours.",
                    "Once dehydrated, store the citrus slices in an airtight container until ready to use."
                ],
                "src": "https://cookingwithjanica.com/how-to-dehydrate-citrus/"
            },
            "marmalade": {
                "name": "Orange Marmalade",
                "description": "Experience the vibrant essence of oranges captured in every spoonful of orange marmalade. This delightful spread combines the perfect balance of sweetness and citrus zing, creating a burst of sunshine in every bite.",
                "ingredients": [
                    "Seedless oranges",
                    "Lemons",
                    "Water",
                    "Sugar"
                ],
                "process": [
                    "Cut oranges and lemons into thin half-moon slices, discarding any seeds. Place them in a large stainless steel pot.",
                    "Add water, bring the mixture to a boil, and stir in sugar until dissolved. Cover and let stand overnight at room temperature.",
                    "The next day, bring the mixture back to a boil. Simmer for 2 hours, then increase heat and boil gently for 30 minutes, skimming off foam.",
                    "Test marmalade by placing a small amount on a plate and refrigerating until cool but not cold. If firm (not runny or hard), it's ready.",
                    "Pour the marmalade into hot mason jars, wipe rims, and seal with lids. Chill in the refrigerator for 24-48 hours for proper setting."
                ],
                "src": "https://www.culinaryhill.com/orange-marmalade-recipe/"
            },
            "curd": {
                "name": "Orange Curd",
                "description": "Luscious and vibrant citrus curd is a delightful accompaniment for breakfast or your favorite snack. With a sweetness akin to fruit jam or preserves, it achieves an extra level of decadence through the addition of egg yolks and butter, creating a rich and indulgent spread.",
                "ingredients": [
                    "Oranges",
                    "Lemons",
                    "Granulated sugar",
                    "Eggs + egg yolks",
                    "Butter",
                    "Salt"
                ],
                "process": [
                    "Use a zester to zest three oranges and one lemon, ensuring to capture only the colorful outer skin, not the bitter white layer underneath. Collect at least 1 tablespoon of orange zest and 1 teaspoon of lemon zest.",
                    "Cut 1-2 oranges to extract 1/2 cup of fresh orange juice. Squeeze the lemon to obtain 1 tablespoon of lemon juice.",
                    "Place a small saucepot over medium heat. Combine 1/2 cup orange juice, 1 tablespoon lemon juice, and all the orange and lemon zest in the pot.",
                    "Introduce sugar, eggs, additional egg yolks, butter, and salt to the pot."
                ],
                "src": "https://www.aspicyperspective.com/easy-orange-curd-recipe/"
            }
        }
    },
    "pomelo": {
        "name": "Pomelo",
        "iconName": "Pomelo",
        "binomial": "Citrus maxima",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "231",
            "Protein": "4.63g",
            "Fat": "0.244g",
            "Carbohydrates": "58.6g",
            "Fiber": "6.09g",
            "Calcium": "24.4mg",
            "Magnesium": "36.5mg",
            "Phosphorus": "104mg",
            "Potassium": "1320mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/167754/nutrients"
        },
        "preservation": {
            "preserve": {
                "name": "Pomelo Preserve",
                "description": "Pomelo slice preserves are a delightful treat, capturing the natural sweetness of pomelos in a jar.",
                "ingredients": [
                    "Peels of 3 pomelo",
                    "750g of sugar",
                    "Juice of 1 lemon",
                    "1 sprig rose geranium"
                ],
                "process": [
                    "Wash the pomelo thoroughly and grate the peel, avoiding the white part.",
                    "Slice the pomelo, separating the peel from the flesh. Discard the flesh.",
                    "Boil the peel in water for 10 minutes, drain in a colander to remove bitterness, and repeat the process four times.",
                    "Wrap each peel and secure with a toothpick.",
                    "Place the wrapped peels in a pot, add water and sugar, and boil for 35-40 minutes until the syrup thickens.",
                    "Before turning off the heat, add lemon juice and a rose geranium sprig.",
                    "Stir, remove the sprig, and check the syrup's consistency on a saucer.",
                    "Once cooled, store the marmalade in sterilized glass jars."
                ],
                "src": "https://deliciouspath.com/pomelo-peels-preserve/"
            },
            "jam": {
                "name": "Pomelo Jam",
                "description": "Pomelo jam is a delightful spread crafted from the vibrant flavors of pomelo fruit, offering a perfect balance of sweetness and citrusy goodness.",
                "ingredients": [
                    "3 large pomelos",
                    "1 1/2 cups granulated sugar",
                    "1 teaspoon dried thyme",
                    "Small pinch of salt"
                ],
                "process": [
                    "Peel the pomelos and carefully remove the fruit from the pith, ensuring minimal white bits remain. No need to chop the fruit as it will break down during cooking.",
                    "In a large saucepan, combine pomelo and sugar with a quarter cup of water. Heat on medium, stirring frequently as the fruit releases juice and sugar melts. Once there is liquid in the pan, increase the heat, bringing the jelly to a boil.",
                    "Continue boiling, stirring constantly, until the jelly reaches 220°F (105°C). Remove from heat and allow it to cool.",
                    "Once cooled slightly, transfer the jelly to a jar with an airtight lid. Store in the fridge and savor the deliciousness."
                ],
                "src": "https://veryveganval.com/2022/03/10/bittersweet-pomelo-jam-with-thyme/"
            },
            "marmalade": {
                "name": "Pomelo Marmalade",
                "description": "Pomelo marmalade is a delightful preserve that captures the essence of pomelo's bright citrus flavor in a sweet and tangy spread.",
                "ingredients": [
                    "3 medium pomelo",
                    "6 cups of white sugar",
                    "3 cups of water"
                ],
                "process": [
                    "Trim the tops and bottoms of the pomelos, discarding them.",
                    "Peel two pomelos with a peeler, extracting long strips of yellow skin, and julienne the strips. Set aside.",
                    "Remove the white pith from all three pomelos, creating three flesh balls.",
                    "Cut each flesh ball in half, remove the central rag and any seeds, then grind the flesh in a food processor.",
                    "Strain the ground flesh, reserving the juice, and grind again for finer texture.",
                    "Combine ground flesh, juice, and julienned skin in a soup pot. Add 3 cups of water.",
                    "Bring to a boil, then simmer covered for 20 minutes.",
                    "Tie pomelo rags into a sachet using cheesecloth and twine.",
                    "Place the sachet in the pot after turning off the heat, ensuring saturation.",
                    "Refrigerate the mixture overnight.",
                    "Squeeze out the sachet into the pomelo mix the next day, discarding the sachet.",
                    "Transfer the pomelo mix to a preserving pan and add 6 cups of sugar.",
                    "Bring the marmalade to a full rolling boil over high heat, stirring.",
                    "Cook uncovered over high heat until a satisfactory gel is achieved.",
                    "If desired, can the marmalade using water-bath canning procedures for 6-8 oz jars, processing for 10 minutes."
                ],
                "src": "https://www.food.com/recipe/pomelo-marmalade-524916"
            }
        }
    },
    "tangerine": {
        "name": "Tangerine",
        "iconName": "Tangerine",
        "binomial": "Citrus reticulata",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "40",
            "Fat": "0.2g",
            "Sodium": "1.5mg",
            "Carbohydrates": "10.1g",
            "Fiber": "1.3g",
            "Sugar": "8g",
            "Protein": "0.6g",
            "Vitamin C": "26.7mg",
            "src": "https://www.verywellfit.com/tangerine-nutrition-facts-calories-and-health-benefits-4115498"
        },
        "preservation": {
            "preserve": {
                "name": "Tangerine Preserve",
                "description": "Tangerine preserves offer a burst of vibrant citrus flavor, with a delightful balance of sweetness and tanginess. Perfect for adding a zing to dishes or spreading on your favorite breakfast treats.",
                "ingredients": [
                    "6-8 tangerines",
                    "1 cup of sea salt",
                    "1 tablespoon of mixed peppercorns",
                    "1 1/2 cups of tangerine juice"
                ],
                "process": [
                    "Cut tangerines into quarters, leaving them connected at the base to form a tulip shape.",
                    "Spoon 2 tablespoons of sea salt into the bottom of a clean quart jar.",
                    "Layer tangerine wedges over the salt, sprinkling a few peppercorns on top.",
                    "Continue filling the jar with alternating layers of salt, citrus, and peppercorns, packing the fruit down to eliminate air spaces.",
                    "Finish with a layer of salt and a scattering of peppercorns. Pour tangerine juice over the top to cover the mixture.",
                    "Screw the lid tightly and refrigerate the jar for 1 month before using. The preserved tangerines can be kept for 6 months or longer.",
                    "To use, rinse off the salt under running water and separate the flesh from the peel. Utilize the softened, salty skin to enhance various winter dishes."
                ],
                "src": "https://www.mountainfeed.com/blogs/learn/preserved-tangerines"
            },
            "juice": {
                "name": "Tangerine Juice",
                "description": "Tangerine juice is a refreshing and citrusy beverage bursting with sweet and tangy flavors. Enjoy it as a standalone treat or mix it into your favorite cocktails for a zesty twist.",
                "ingredients": [
                    "28oz peeled tangerine",
                    "1 cup of water",
                    "2 tablespoons of sugar (Optional)",
                    "1 teaspoon of lemon juice",
                    "2 cups of ice",
                    "8 baby mint leaves"
                ],
                "process": [
                    "Juice 28 oz of peeled tangerines using a juicer. Collect the juice.",
                    "Dilute the tangerine juice with 1 cup of water. Stir in 1 tsp lemon juice (and sugar to your taste, with a maximum of 2 tbsp).",
                    "Serve the refreshing drink chilled or with ice, garnished with baby mints."
                ],
                "src": "https://healthyrecipes101.com/juice/recipe/tangerine-juice-recipe/"
            },
            "canning": {
                "name": "Tangerine Canning",
                "description": "Tangerine canning is a delightful process of preserving the vibrant citrus flavor of tangerines. Whether in syrup or as preserves, canned tangerines offer a burst of sweetness and tanginess all year round.",
                "ingredients": [
                    "2lbs of tangerine",
                    "1 1/2 cups of water",
                    "3/8 cups of sugar"
                ],
                "process": [
                    "Peel the tangerines, discard the peels, and remove pith from segments.",
                    "Make a light syrup by combining water and sugar in a saucepan over medium heat. Keep warm without boiling.",
                    "Pack tangerine segments into jars, pour in the syrup, leaving 1/2 inch of headspace.",
                    "Apply lids and rings.",
                    "Process using a standard water bath canning process for 10 minutes."
                ],
                "src": "https://www.thespruceeats.com/canned-mandarin-oranges-recipe-1327456"
            }
        }
    },
    "guava": {
        "name": "Guava (Bayabas)",
        "iconName": "Guava",
        "binomial": "Psidium guajava",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Serving size": "1 cup (165g)",
            "Calories": "112",
            "Fat": "1.6g",
            "Sodium": "3.3mg",
            "Carbohydrates": "23.6g",
            "Fiber": "8.9g",
            "Sugar": "14.7g",
            "Protein": "4.2g",
            "Vitamin C": "376mg",
            "Folate": "81mcg",
            "Potassium": "688mg",
            "src": "https://www.verywellfit.com/carb-counts-for-guava-2241794"
        },
        "preservation": {
            "jelly": {
                "name": "Guava Jelly",
                "description": "Guava jelly is a delightful spread made from the tropical sweetness of ripe guavas. This vibrant jelly, with its natural fruity flavor, adds a tropical touch to your breakfast or snack time.",
                "ingredients": [
                    "6-8 ripe guava",
                    "4 cups of water",
                    "3 tabelospoons of fresh lemon juice",
                    "3 cups of sugar",
                    "1 pinch of saffron"
                ],
                "process": [
                    "Wash guavas and slice into small pieces.",
                    "Boil for 15-20 minutes until very soft.",
                    "Mash or whisk the softened guavas.",
                    "Strain and continue mashing to extract juice and pulp, eliminating seeds and skin.",
                    "Add lemon juice, sugar, and saffron. Stir well.",
                    "Bring the mixture to a boil on high heat, stirring occasionally. Cook for 30-40 minutes.",
                    "Stir continuously when boiling rapidly to avoid hardening.",
                    "Achieve a moderately thick consistency without overcooking.",
                    "Cool completely before transferring to clean or sterilized jars.",
                    "Store the Guava Jelly jars in the fridge and pair with your favorite bread."
                ],
                "src": "https://www.pinoycookingrecipes.com/guava-jamjelly.html"
            },
            "drying": {
                "name": "Drying",
                "description": "Dried guava is a delicious and naturally sweet snack with a chewy texture. Packed with tropical flavor, these dried guava slices offer a convenient and healthy option for satisfying your sweet cravings.",
                "ingredients": [
                    "1kg of fresh guava",
                    "300g of white sugar",
                    "1 vanilla tube"
                ],
                "process": [
                    "Peel guava, remove the inside, and cut into thin 2 cm pieces.",
                    "Wash guava with water and lemon juice, then rinse with diluted saline for 15 minutes. Finally, wash with clean water and drain.",
                    "Marinate drained guava with white sugar (300g per 1kg guava) for about 5 hours.",
                    "Wait for sugar to dissolve and guava to release water, reducing sugar water to approximately 1 cup.",
                    "Cook marinated guava on low heat, add vanilla extract, and stir until sugar crystallizes on the guava.",
                    "Turn off the stove, spread guava on a paper-lined tray, and expose to the sun for 4 to 5 hours or dry in a thermo oven at 100 degrees.",
                    "Allow guava jam to cool, then store in a tightly closed jar in a cool, dry place, or refrigerate for gradual use."
                ],
                "src": "https://luonggiacompany.com/en/how-to-make-dried-guava-at-home/"
            },
            "canning": {
                "name": "Canning",
                "description": "Canning guava allows you to preserve the tropical goodness of this fruit, capturing its sweet and aromatic essence in jars. Enjoy the taste of ripe guavas year-round by following the canning process, ensuring a burst of flavor in every jar.",
                "ingredients": [
                    "Guavas",
                    "Sugar",
                    "Water"
                ],
                "process": [
                    "Prepare jars and heat water in the canner, ensuring it's hot but not boiling when processing.",
                    "Wash, peel, and halve guava fruit, removing seeds.",
                    "Make sugar syrup and bring it to a boil.",
                    "Turn off heat and add guavas to the syrup, letting them set for 30 minutes to heat through.",
                    "Remove fruit from the syrup with a slotted spoon and pack into hot jars.",
                    "Reheat syrup to boiling, cover fruit with hot syrup, leaving 1/2” headspace.",
                    "Remove air bubbles, wipe rims clean, and place seals and rings on the jars.",
                    "Put jars in the warm canner."
                ],
                "src": "https://www.simplycanning.com/canning-guava-fruit/"
            }
        }
    },
    "papaya": {
        "name": "Papaya",
        "iconName": "Papaya",
        "binomial": "Carica papaya",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "62",
            "Fat": "0.4g",
            "Sodium": "11.6mg",
            "Carbohydrates": "16g",
            "Fiber": "2.5g",
            "Sugar": "11g",
            "Protein": "0.7g",
            "Vitamin A": "68.2mcg",
            "Vitamin C": "88.3mg",
            "src": "https://www.verywellfit.com/papayas-nutrition-facts-calories-and-health-benefits-4114326"
        },
        "preservation": {
            "ice_cream": {
                "name": "Ice Cream",
                "description": "A luscious frozen treat featuring the tropical sweetness of ripe papaya. Creamy and refreshing, it offers a delightful twist on traditional ice cream flavors.",
                "ingredients": [
                    "1/2 large ripe papaya, cut into cubes and frozen",
                    "1.5 cups of frozen pineapple",
                    "1 cup of frozen mango",
                    "13.5oz can of coconut cream",
                    "1/4 cup of agave syrup",
                    "1 teaspoon of vanilla extract"
                ],
                "process": [
                    "Combine the ingredients in a food processor, using the thick part of the coconut cream and setting aside the liquid.",
                    "Blend the ingredients until smooth. If the mixture is too thick, incorporate some of the reserved coconut liquid until the desired consistency is reached.",
                    "Transfer the mixture to a metal loaf pan or freezer-safe container.",
                    "For a soft-serve consistency, serve immediately. Alternatively, freeze for 2-4 hours for a firmer texture. If using a loaf pan, cover the surface with parchment paper and wrap the pan in plastic wrap to prevent ice crystals."
                ],
                "src": "https://goodfoodbaddie.com/tropical-papaya-ice-cream/"
            },
            "juice": {
                "name": "Papaya Juice",
                "description": "A tropical and refreshing beverage made from ripe papayas. It boasts a sweet and vibrant flavor, providing a delightful taste of the tropics in every sip.",
                "ingredients": [
                    "Papaya",
                    "1 tablespoon of honey",
                    "1 tablespoon of lemon juice",
                    "3/4 cup of cold water"
                ],
                "process": [
                    "Peel the papaya, remove the seeds, and cut it into chunks or slices for easier blending.",
                    "Add the ingredients to a blender.",
                    "Blend on high speed until you achieve a smooth consistency.",
                    "Pour into glasses, with or without ice, and enjoy!"
                ],
                "src": "https://goodfoodbaddie.com/papaya-juice-recipe/"
            },
            "jam": {
                "name": "Papaya Jam",
                "description": "A luscious spread crafted from ripe papayas, offering a tropical twist to traditional fruit preserves. With its sweet and exotic flavor, it adds a delightful touch to breakfasts and snacks.",
                "ingredients": [
                    "1kg papaya",
                    "600g of granulated sugar",
                    "2 teaspoons of vanilla extract",
                    "Juice of 1/2 a lemon"
                ],
                "process": [
                    "Cube the papaya and place it in a bowl.",
                    "Add the sugar and lemon juice, mix well, and refrigerate for 3 hours.",
                    "Cook the mixture, stirring, for about 20 to 30 minutes or until it thickens.",
                    "After 15 minutes of cooking, add the vanilla extract.",
                    "While the jam is cooking, place a small plate in the freezer.",
                    "After 20 minutes, when the jam starts to gel, turn off the heat.",
                    "Spoon a small amount of jam onto the frozen plate and return it to the freezer for a few minutes. If it wrinkles when nudged, it's ready. If not, continue cooking and testing until it reaches the desired consistency.",
                    "Blend the jam with a hand blender and store it in sterilized jars."
                ],
                "src": "https://www.manusmenu.com/papaya-jam?cn-reloaded=1"
            }
        }
    },
    "sapodilla": {
        "name": "Sapodilla (Chico)",
        "iconName": "Sapodilla",
        "binomial": "Manilkara zapota",
        "type": "Fruit",
        "season": ["January", "February"],
        "nutrients": {
            "Calories": "141",
            "Protein": "0.748g",
            "Fat": "1.87g",
            "Carbohydrates": "34g",
            "Fiber": "9.01g",
            "Calcium": "35.7mg",
            "Potassium": "328mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/167759/nutrients"
        },
        "preservation": {
            "dehydration": {
                "name": "Dehydration",
                "description": "Dehydrated sapodilla offers a concentrated and chewy treat with the distinct caramel-like sweetness of the fruit. The dehydration process intensifies the natural flavors, resulting in a delightful snack that captures the essence of ripe sapodilla.",
                "ingredients": [
                    "Fresh sapodilla"
                ],
                "process": [
                    "Wash fully ripe fruits and peel them.",
                    "Cut the fruits into halves along the 'equator' with a stainless steel knife.",
                    "Remove the seeds and dry the deseeded halves in an electric dryer, maintaining temperatures of 70°C initially and 55°C finally.",
                    "Complete the drying process over about 4 days, operating the dryer for 8 hours a day.",
                    "Once dried, cut the halves into slices (rings) and string them into a garland using twine cord.",
                    "Pack the dried product in 400-gauge polyethylene bags, sealing them with heat.",
                    "Store the packed product at a low temperature (5°C) for optimal quality retention, extending shelf life up to one year.",
                    "Note that under ambient storage conditions (25-35°C temperature and 65-85% relative humidity), storage pests become a problem, and the product's quality deteriorates within six months."
                ],
                "src": "https://rfcarchives.org.au/Next/Fruits/Sapodilla/SapodillaDry9-87.htm"
            },
            "juice": {
                "name": "Chico Juice",
                "description": "A sweet and refreshing beverage made from the pulp of ripe sapodilla fruit. Known for its delectable caramel-like flavor, sapodilla juice offers a delightful tropical taste with a hint of brown sugar notes. Enjoyed chilled, this juice provides a unique and satisfying drink for those seeking a tropical and naturally sweet experience.",
                "ingredients": [
                    "2 chico",
                    "5 soaked almonds",
                    "3 cashew nuts",
                    "1 tablespoon of honey"
                ],
                "process": [
                    "Place almonds and cashew nuts in a mixer jar, and grind them coarsely.",
                    "Add freshly cut chicos and a little water to the jar. Grind until a smooth juice is obtained.",
                    "Mix in honey or sugar for sweetness.",
                    "Serve the healthy chikoo juice and enjoy!"
                ],
                "src": "https://yummyashaskitchen.com/healthy-chikoo-juice-recipe/"
            }
        }
    },
    "star_apple": {
        "name": "Star Apple (Caimito)",
        "iconName": "Star Apple",
        "binomial": "Chrysophyllum cainito",
        "type": "Fruit",
        "season": ["January", "February", "March"],
        "nutrients": {
            "Calories": "116.5",
            "Protein": "3.9g",
            "Fat": "5.5g",
            "Fiber": "4.1g",
            "Carbohydrates": "8g",
            "Potassium": "666.21mg",
            "Calcium": "365.5mg",
            "Phosphorus": "211mg",
            "src": "https://www.webmd.com/diet/benefits-of-african-star-apple"
        },
        "preservation": {
            "juice": {
                "name": "Caimito Juice",
                "description": "A refreshing and naturally sweet beverage made from the pulpy, aromatic flesh of star apples. The fruits are peeled, and their luscious, juicy segments are extracted to create a delightful, flavorful drink.",
                "ingredients": [
                    "1 small apple",
                    "2 medium oranges",
                    "2 small star fruit",
                    "2 tablespoon of honey"
                ],
                "process": [
                    "Remove the seeds and core of the star fruits, apples, and oranges, then cut them into chunks.",
                    "Put all the ingredients, along with honey, into a blender and blend until smooth.",
                    "Sieve the mixture and serve immediately."
                ],
                "src": "https://cookpad.com/us/recipes/367919-apple-and-star-fruit-juice"
            },
            "tart": {
                "name": "Tart",
                "description": "A delectable dessert that combines the sweet and creamy flavor of star apples with a buttery, flaky crust. The star apple slices are arranged in a visually appealing pattern atop the pastry, creating a beautiful mosaic of flavors.",
                "ingredients": [
                    "2 star fruit, cut crosswise and seeded",
                    "1/2 cup of light brown sugar",
                    "2 tablespoons of cornstarch",
                    "2 tablespoons of butter",
                    "9-inch pie crust",
                    "2 tablespoons of lemon curd",
                    "1 tablspoon of fruit jelly",
                    "1 teaspoon of water"
                ],
                "process": [
                    "Preheat the oven to 350 degrees.",
                    "Melt 1 tbsp butter on medium heat.",
                    "Add star apples, brown sugar, and cornstarch; mix gently.",
                    "Cook over medium-low heat for 3 minutes or until the mixture thickens; set aside.",
                    "Unroll the pie crust on a lightly greased cookie sheet.",
                    "Spread lemon curd evenly on the pie crust.",
                    "Add the star apple-sugar mixture in the middle of the pie crust, spreading it evenly and leaving enough space on the sides to fold the crust over the filling.",
                    "Fold and tuck the sides of the pie crust and brush butter evenly on the crust.",
                    "Bake for 10 minutes or until the crust is golden brown.",
                    "Take out of the oven and set aside to cool.",
                    "Warm fruit jelly and water over the stovetop or microwave, mix well.",
                    "Brush the jelly glaze over the tart."
                ],
                "src": "https://food52.com/recipes/40385-star-apple-tart"
            }
        }
    },
    "strawberry": {
        "name": "Strawberry",
        "iconName": "Strawberry",
        "binomial": "Fragaria ananassa",
        "type": "Fruit",
        "season": ["January", "February", "March", "April", "May", "November", "December"],
        "nutrients": {
            "Calories": "49",
            "Carbohydrates": "11.7g",
            "Protein": "1g",
            "Fat": "0.5g",
            "Sugar": "7.4g",
            "Sodium": "1.5mg",
            "Fiber": "3g",
            "Vitamin C": "89.4mg",
            "Potassium": "233mg",
            "src": "https://www.verywellfit.com/strawberries-carb-counts-and-health-benefits-1087572"
        },
        "preservation": {
            "curd": {
                "name": "Strawberry Curd",
                "description": "A luscious spread bursting with the sweet and tart flavors of fresh strawberries. This velvety curd can elevate your breakfast or dessert with its vibrant taste and smooth texture.",
                "ingredients": [
                    "454g fresh strawberries",
                    "100g sugar",
                    "2 whole large eggs",
                    "4 large egg yolks",
                    "3 tablespoons of lemon juice",
                    "1/4 tablespoon of salt",
                    "5 tablespoons of unsalted butter"
                ],
                "process": [
                    "Place a medium-sized heatproof bowl with a fine mesh strainer nearby.",
                    "Remove strawberry stems, coarsely chop the strawberries, and place them in a 4-quart saucepan with sugar and lemon juice.",
                    "Bring strawberries to a boil, then reduce to medium heat. Cook until reduced to 1-3/4 cups, approximately 7 minutes, stirring occasionally.",
                    "Smash any remaining strawberry pieces or use an immersion blender for complete pureeing.",
                    "Taste and add sugar incrementally for desired sweetness, being cautious not to oversweeten.",
                    "Cool the strawberry mixture to room temperature, then add whole eggs, egg yolks, and salt. Whisk to combine.",
                    "Cook over medium heat, whisking constantly until it thickens and reaches around 190°F, about 10-12 minutes.",
                    "Remove from heat and add butter one tablespoon at a time, whisking thoroughly after each addition.",
                    "Strain the curd into a bowl to remove solids.",
                    "Cover with plastic wrap, pressing it onto the curd's surface to prevent skin formation, and refrigerate for at least 4 hours or overnight.",
                    "The curd will thicken as it cools and can be refrigerated for up to 3 weeks."
                ],
                "src": "https://bakesbybrownsugar.com/strawberry-curd/"
            },
            "jam": {
                "name": "Strawberry Jam",
                "description": "A classic and delightful preserve made by cooking fresh strawberries with sugar and pectin until it reaches a thick, spreadable consistency. Whether slathered on toast, paired with pastries, or used as a topping for desserts, strawberry jam captures the essence of ripe strawberries in a sweet, fruity jar.",
                "ingredients": [
                    "2lbs strawberries",
                    "1 1/2 cups of sugar",
                    "1 tablespoon of lemon juice",
                    "2 tablespoons of powdered fruit pectin"
                ],
                "process": [
                    "Clean and hull strawberries using a huller, removing stems and leaves. Dice strawberries and place them in a medium-sized saucepan.",
                    "Add sugar, lemon juice, and pectin to the saucepan. Stir to combine.",
                    "Heat over medium heat until strawberries release juice and simmer along the pot's edge.",
                    "Mash strawberries to the desired consistency while continuing to cook over medium heat.",
                    "Continue cooking for an additional 5 minutes or until the mixture thickens.",
                    "Pour the jam into jars or containers, seal, and let cool to room temperature.",
                    "Once cooled, store the jam in the refrigerator or freezer."
                ],
                "src": "https://therecipecritic.com/strawberry-jam/"
            },
            "juice": {
                "name": "Strawberry Juice",
                "description": "A refreshing beverage crafted by blending ripe strawberries and straining the mixture to extract their vibrant essence. This naturally sweet and fruity drink offers a burst of summer flavor, perfect for sipping on a hot day or using as a base for creative cocktails and mocktails.",
                "ingredients": [
                    "2 cups of ripe strawberries",
                    "Juice from 1/4 lime or lemon (Optional)",
                    "1 tablespoon of sugar (Optional)",
                    "1 cup of cold water",
                    "2 ice cubes",
                    "1 halved strawberry, for garnishing"
                ],
                "process": [
                    "Wash strawberries, remove stems, and cut into small pieces.",
                    "In a blender, combine strawberries, sugar, and lime juice (adjust quantities based on strawberry ripeness).",
                    "Blend until a smooth puree is formed. Add water and blend for an additional minute.",
                    "Place a fine mesh strainer over a large container and strain the prepared juice to remove foam from blending. Cheesecloth can also be used for this step (optional).",
                    "Add one ice cube to each glass and pour the sweet and sour fresh strawberry fruit juice over it. Place halved strawberries on the rim of each glass for a tempting presentation. Serve and enjoy!"
                ],
                "src": "https://foodviva.com/juice-recipes/strawberry-juice-recipe/"
            },
            "canning": {
                "name": "Canning",
                "description": "Canning strawberries involves preserving the freshness of ripe berries by immersing them in jars with sugar or syrup. The canning process ensures the strawberries maintain their taste and texture over an extended period, allowing you to enjoy the harvest's goodness throughout the year. This method is ideal for creating jams, pie fillings, or standalone canned strawberries.",
                "ingredients": [
                    "4 cups of strawberries",
                    "1/2 cup of sugar (Optional)",
                    "1/4 to 1/2 teaspoon of citric acid (Optional)"
                ],
                "process": [
                    "Wash and hull strawberries, place in a pot.",
                    "Sprinkle sugar, stir, and let macerate for 6 hours (covered).",
                    "Set up water bath canner and canning jars.",
                    "Add citric acid (optional) to strawberries.",
                    "Simmer strawberries for 1 minute until heated through.",
                    "Pack strawberries into jars, leaving 1/2 inch headspace.",
                    "Cover with strawberry juice, remove air bubbles, adjust headspace, and seal.",
                    "Process in water bath canner for 10 minutes (pints) or 15 minutes (quarts)."
                ],
                "src": "https://practicalselfreliance.com/canning-strawberries/"
            }
        }
    },
    "sugar_apple": {
        "name": "Sugar Apple (Atis)",
        "iconName": "Sugar Apple",
        "binomial": "Annona squamosa",
        "type": "Fruit",
        "season": [],
        "nutrients": {
            "Calories": "235",
            "Fat": "0.7g",
            "Cholesterol": "0mg",
            "Sodium": "23mg",
            "Carbohydrates": "59g",
            "Fiber": "11g",
            "Protein": "5.2g",
            "Calcium": "60mg",
            "Iron": "1.5mg",
            "Potassium": "617.5mg",
            "src": "https://www.nutritionix.com/food/sugar-apple"
        },
        "preservation": {
            "juice": {
                "name": "Sugar Apple Juice",
                "description": "The juice captures the rich, distinct flavor of the fruit, balancing sweetness with a hint of tartness. Refreshing and satisfying, sugar apple juice is a delightful tropical beverage enjoyed for its unique taste and inherent goodness.",
                "ingredients": [
                    "2 sugar apple",
                    "1/2 teaspoon of cardamom powder",
                    "2 tablespoons of sugar",
                    "1 cup of cold water"
                ],
                "process": [
                    "Peel the skin.",
                    "Remove the fruit pulp.",
                    "Blend the fruit pulp with cardamom powder, sugar, and cold water.",
                    "Optionally, substitute honey for sugar."
                ],
                "src": "https://www.plattershare.com/recipe/athachakka-sweet-sop-juice/"
            }
        }
    },
    "grapes": {
        "name": "Grapes (Ubas)",
        "iconName": "Grapes",
        "binomial": "Vitis vinifera",
        "type": "Fruit",
        "season": ["March", "April", "May", "September", "December"],
        "nutrients": {
            "Calories": "62",
            "Fat": "0.3g",
            "Sodium": "2mg",
            "Carbohydrates": "16g",
            "Fiber": "1g",
            "Sugar": "15g",
            "Protein": "0.6g",
            "Vitamin C": "3.68mg",
            "Vitamin K": "13.4mcg",
            "Vitamin A": "4.6mcg",
            "src": "https://www.verywellfit.com/grapes-nutrition-facts-calories-and-health-benefits-4111390"
        },
        "preservation": {
            "freezing": {
                "name": "Freezing",
                "description": "Freezing grapes is a simple preservation method. Frozen grapes make for a refreshing, icy snack.",
                "ingredients": [
                    "Fresh grapes"
                ],
                "process": [
                    "Wash and dry the grapes.",
                    "Arrange the clean grapes on a baking sheet lined with parchment paper, cover with plastic wrap.",
                    "Freeze the grapes on the baking sheet for 2-3 hours until solid.",
                    "Transfer the frozen grapes to an airtight container or freezer bag.",
                    "Store in the freezer; frozen grapes can last up to a year using this method."
                ],
                "src": "https://www.realsimple.com/can-you-freeze-grapes-7564698"
            },
            "jelly": {
                "name": "Grape Jelly",
                "description": "A sweet and spreadable preserve, perfect for toast or as a topping for desserts.",
                "ingredients": [
                    "1kg red grapes",
                    "450g of jam sugar",
                    "Juice of 1 lemon"
                ],
                "process": [
                    "Place grapes in a saucepan over low heat and cook for 5 mins until juices release. Mash grapes occasionally for the next 10 mins.",
                    "Set a sieve with a clean cloth over a bowl, pour grape mixture into it, and let it drip for at least 1 hr or overnight.",
                    "Measure the juice (around 600ml) and combine it with sugar and lemon juice in a pan.",
                    "Bring the mixture to a boil, skimming scum. Boil until it reaches 105C on a sugar thermometer or wrinkles on a cold saucer test.",
                    "Pour the hot jam into a sterilized jar. Keeps unopened for up to 3 months."
                ],
                "src": "https://www.bbcgoodfood.com/recipes/grape-jelly"
            },
            "pickle": {
                "name": "Grape Pickle",
                "description": "Pickled grapes offer a unique and tangy twist. Submerge grapes in a pickling liquid made with vinegar, sugar, and spices. Allow them to marinate, and the result is a flavorful, slightly tart treat.",
                "ingredients": [
                    "1lb of seedless red grapes",
                    "1 1/2 cups of apple cider vinegar",
                    "1 cup of water",
                    "1 cup of raw sugar",
                    "1/2 small red onion",
                    "2 teaspoons of yellow mustard seeds",
                    "1 teaspoon of whole black peppercorns",
                    "1 cinnamon stick",
                    "1 bay leaf",
                    "1 star anise pod",
                    "1 whole allspice"
                ],
                "process": [
                    "Remove stems and discard damaged grapes. Place grapes in a quart-size mason jar.",
                    "Combine vinegar, water, sugar, red onion, mustard seeds, peppercorns, cinnamon stick, bay leaf, star anise, and allspice in a saucepan; bring to a boil.",
                    "Reduce heat and simmer for 10 minutes until the onion is softened. Remove from heat and cool for 15 minutes.",
                    "Carefully pour cooled liquid over grapes, swirl the jar to incorporate spices. Cover and refrigerate for 1 day before eating."
                ],
                "src": "https://www.allrecipes.com/recipe/244471/pickled-grapes/"
            },
            "drying": {
                "name": "Drying",
                "description": "Drying grapes, either in the sun or using a dehydrator, transforms them into raisins. The natural sugars concentrate, creating a chewy and sweet snack that can be added to cereals, baked goods, or enjoyed on its own.",
                "ingredients": [
                    "Fresh grapes"
                ],
                "process": [
                    "Wash and dry grapes.",
                    "Pierce grapes to allow moisture to escape when dehydrating.",
                    "Place on lightly oil-sprayed baking sheets.",
                    "Dry in the oven at 145°F for 5 to 8 hours or more, depending on grape size. Higher temperatures may cook the raisins.",
                    "Leave the oven door open at least 2 inches for air circulation. Check every few hours for doneness.",
                    "When dried to your desired firmness, remove from the oven, let cool thoroughly.",
                    "Store in an airtight container for up to a few weeks."
                ],
                "src": "https://www.pcfma.org/blog/heres-grape-idea-make-your-own-raisins#:~:text=Pierce%20grapes%20to%20allow%20moisture,raisins%20rather%20than%20drying%20them."
            },
            "fermentation": {
                "name": "Fermentation",
                "description": "Fermenting grapes leads to the production of wine. Crushed grapes undergo fermentation, where yeast converts sugars into alcohol. The process can be adjusted to create various wine varieties, from sweet to dry, red to white.",
                "ingredients": [
                    "Lots of grapes",
                    "Granulated sugar",
                    "Filtered water",
                    "Wine yeast"
                ],
                "process": [
                    "Sterilize equipment and select grapes.",
                    "Wash, remove stems, and crush grapes.",
                    "Add wine yeast and check hydrometer.",
                    "Allow primary fermentation for 1-10 days.",
                    "Strain, transfer to glass containers, and airlock.",
                    "Ferment for several weeks; rack periodically.",
                    "Bottle, leaving space for cork. Insert corks and store upright for 3 days. Store on its side at 55°F.",
                    "Age red wine for a year, white for six months."
                ],
                "src": "https://www.allrecipes.com/article/how-to-make-wine-at-home/"
            }
        }
    },
    "jackfruit": {
        "name": "Jackfruit (Langka)",
        "iconName": "Jackfruit",
        "binomial": "Artocarpus heterophyllus",
        "type": "Fruit",
        "season": ["March", "April", "May"],
        "nutrients": {
            "Calories": "157",
            "Fat": "1.1g",
            "Sodium": "3.3mg",
            "Carbohydrates": "38.3g",
            "Fiber": "2.5g",
            "Sugar": "32g",
            "Protein": "2.8g",
            "Vitamin C": "22.6mg",
            "Potassium": "739mg",
            "src": "https://www.verywellfit.com/jackfruit-nutrition-facts-4770410"
        },
        "preservation": {
            "jam": {
                "name": "Jackfruit Jam",
                "description": "A luscious spread capturing the natural sweetness of ripe jackfruit. This jam, with its tropical essence, is a delightful addition to your morning toast or as a versatile ingredient in desserts.",
                "ingredients": [
                    "500g of ripe jackfruit",
                    "1/2 kg white sugar",
                    "2 pcs of lime",
                    "1 pinch of salt"
                ],
                "process": [
                    "Prepare ripe jackfruit by removing seeds and slicing into pieces. Wash thoroughly.",
                    "Set aside 5-10 small jackfruit pieces and slice them finely.",
                    "Blend the remaining jackfruit in a blender until achieving a smoothie-like consistency.",
                    "Combine blended jackfruit with the sliced pieces in a pot.",
                    "Add sugar, lime juice, and a pinch of salt to the pot.",
                    "Bring the mixture to a boil on low to medium heat, stirring occasionally.",
                    "Once it reaches a sticky, honey-like consistency, remove from heat and let it cool.",
                    "Transfer the jackfruit jam to a sanitized glass container and refrigerate. Enjoy as a spread!"
                ],
                "src": "https://momfoodblog.com/jackfruit-jam-recipe/"
            },
            "juice": {
                "name": "Jackfruit Juice",
                "description": "Refreshing and exotic, jackfruit juice is a tropical delight that captures the essence of this unique fruit. Served chilled, it offers a sweet and slightly tangy taste, making it a perfect thirst-quencher on a warm day.",
                "ingredients": [
                    "2 cups of ripe jackfruit meat",
                    "4 tablespoons of lime juice",
                    "2 cups of unsweetened unflavored plant milk"
                ],
                "process": [
                    "Combine all ingredients in a blender.",
                    "Blend on high for 30 seconds or until uniformly blended.",
                    "Serve immediately or store for later use."
                ],
                "src": "https://gastroplant.com/3-ingredient-jackfruit-smoothie/"
            },
            "pickle": {
                "name": "Jackfruit Pickle",
                "description": "Infused with aromatic spices, the tender jackfruit pieces are pickled to perfection, offering a flavorful accompaniment to your meals.",
                "ingredients": [
                    "1kg of raw jackfruit",
                    "300ml edible mustard oil",
                    "2 tablespoon of fennel seeds",
                    "1 tablespoon of cumin seeds",
                    "5 tablespoons of split mustard seeds",
                    "1 tablespoon of nigella seeds",
                    "1.5 tablespoon of coriander powder",
                    "1 teaspoon of turmeric powder",
                    "2 teaspoons of red chili powder",
                    "2 teaspoons of salt",
                    "1 teaspoon of asafoetida",
                    "1/3 cup of white vinegar"
                ],
                "process": [
                    "Blanch jackfruit pieces in a large pan with 1/2 teaspoon of salt until tender but not fully cooked.",
                    "Drain the water and let the jackfruit pieces dry on a towel in the sun or under a fan for 1 hour to remove moisture.",
                    "Dry roast fennel and cumin seeds, then grind them coarsely.",
                    "Heat half of the mustard oil to its smoking point, let it cool for 3-4 minutes, and add jackfruit pieces, spices, and vinegar. Mix well and transfer to a glass jar.",
                    "Heat the remaining oil for 3-4 minutes, pour it into the jar, and seal with a lid. Shake the jar and place it in sunlight for 3-4 days to pickle."
                ],
                "src": "https://yourfoodfantasy.com/jackfruit-pickle/"
            }
        }
    },
    "java_apple": {
        "name": "Java Apple (Makopa)",
        "iconName": "Java Apple",
        "binomial": "Syzygium samarangense",
        "type": "Fruit",
        "season": ["March", "April", "May"],
        "nutrients": {
            "Calories": "56",
            "Protein": "0.6g",
            "Fat": "0.3g",
            "Carbohydrates": "14g",
            "Calcium": "29mg",
            "Fiber": "1.9g",
            "Magnesium": "5mg",
            "Phosphorus": "8mg",
            "Potassium": "50mg",
            "src": "https://www.timesfoodie.com/nutritional-facts/jamrul-rose-apple-java-apple-health-benefits-nutrition/89728739.cms"
        },
        "preservation": {
            "jam": {
                "name": "Jam",
                "description": "Java apple jam is a delightful preserve made from the succulent and slightly tangy flesh of Java apples. Sweetened to perfection, this jam captures the unique flavor of Java apples in a spreadable, fruity delight.",
                "ingredients": [
                    "500g of java apple",
                    "1 tablespoon of lime juice",
                    "575g of sugar",
                    "150ml of water"
                ],
                "process": [
                    "Choose ripe red rose apple fruits.",
                    "Carefully remove the seeds.",
                    "Soak the seeds in water mixed with 1 tablespoon of lime juice.",
                    "In a pan, bring 575 grams of sugar into 150 ml of water to a boil, allowing it to thicken.",
                    "Add the rose apple fruits to the syrup and boil.",
                    "If the redness is insufficient, add permitted food coloring to highlight the redness."
                ],
                "src": "https://www.yummytummyaarthi.com/jambakka-juice-recipe/"
            },
            "juice": {
                "name": "Juice",
                "description": "Java apple juice is a refreshing and naturally sweet beverage crafted from the pulpy goodness of Java apples. With its crisp and mildly sweet taste, Java apple juice offers a tropical twist to your regular fruit juices.",
                "ingredients": [
                    "15 pcs of java apple",
                    "2 tablespoons of sugar",
                    "Lemon juice, adjust to taste",
                    "Water, as need"
                ],
                "process": [
                    "Place all ingredients in a blender and puree until smooth.",
                    "Strain the mixture.",
                    "Chill the juice, and serve accordingly."
                ],
                "src": "https://bfnsrilanka.org/wood-apple-5/wood-apple-juice-6"
            }
        }
    },
    "java_plum": {
        "name": "Java Plum (Duhat)",
        "iconName": "Java Plum",
        "binomial": "Syzygium cumini",
        "type": "Fruit",
        "season": ["March", "April", "May", "June", "July"],
        "nutrients": {
            "Calories": "5.4",
            "Protein": "0.06g",
            "Fat": "0.02g",
            "Carbohydrates": "1.4g",
            "Calcium": "1.71mg",
            "Magnesium": "1.35mg",
            "Phosphorus": "1.53mg",
            "Potassium": "7.11mg",
            "Vitamin C": "1.29mg",
            "src": "https://www.urmc.rochester.edu/encyclopedia/content.aspx?contenttypeid=76&contentid=09145-2"
        },
        "preservation": {
            "vinegar": {
                "name": "Plum Vinegar",
                "description": "Java Plum Vinegar is a tangy and flavorful condiment crafted from ripe java plums.",
                "ingredients": [
                    "500g of java plum",
                    "1 1/4 cup of white balsamic vinegar",
                    "1 cup and 2 tablespoons of white sugar",
                    "1 cinnamon stick",
                    "1/2 teaspoon allspice powder",
                    "1/2 teaspoon crushed cloves"
                ],
                "process": [
                    "In a medium-sized pot on low heat, dissolve sugar in vinegar by stirring.",
                    "Add spices and simmer for 5 minutes.",
                    "Incorporate pitted plums into the vinegar mixture and simmer for an additional 10 minutes on low heat.",
                    "Allow the mixture to cool at room temperature for about 4 hours.",
                    "After cooling, remove the cinnamon stick and manually mash the plums.",
                    "Strain the mashed pulp through a fine sieve to obtain a thick syrup, constituting your homemade vinegar.",
                    "The resulting vinegar can be used immediately or stored in the fridge."
                ],
                "src": "https://www.2pots2cook.com/2022/09/15/plum-vinegar-from-scratch/"
            },
            "preserve": {
                "name": "Plum Preserve",
                "description": "Java Plum Preserve is a sweet and fruity delight made from luscious java plums. With its rich, vibrant flavor and smooth consistency, this preserve is perfect for spreading on toast, enhancing desserts, or adding a burst of fruity goodness to your favorite snacks.",
                "ingredients": [
                    "4lbs of java plums, pitted and quartered",
                    "3/4 cups and 1 tablespoon of superfine sugar"
                ],
                "process": [
                    "Put plums in a large pot and toss with sugar. Let it sit for an hour to release juices.",
                    "Bring the pot to a boil over medium-high heat.",
                    "Reduce heat to medium-low and simmer for 1 hour, stirring occasionally.",
                    "Remove from heat and let it cool for 30 to 45 minutes.",
                    "Repeat steps 2 through 4 twice more.",
                    "Allow the mixture to cool before pouring into sterilized jars for canning."
                ],
                "src": "https://www.spoonforkbacon.com/black-plum-preserves/"
            }
        }
    },
    "mango": {
        "name": "Mango (Mangga)",
        "iconName": "Manggo",
        "binomial": "Mangifera carabao",
        "type": "Fruit",
        "season": ["March", "April", "May", "June"],
        "nutrients": {
            "Calories": "99",
            "Fat": "0.6g",
            "Sodium": "2mg",
            "Carbohydrates": "25g",
            "Fiber": "2.6g",
            "Sugar": "23g",
            "Protein": "1.4g",
            "Vitamin C": "60mg",
            "Vitamin E": "1.5mg",
            "Folate": "71mcg",
            "src": "https://www.verywellfit.com/mango-calories-and-nutrition-facts-3982611"
        },
        "preservation": {
            "jam": {
                "name": "Mango Jam",
                "description": "A sweet and luscious spread made from ripe mangoes, perfect for topping toast or pastries.",
                "ingredients": [
                    "2lbs of ripe mangoes",
                    "1 1/2 cups of white sugar",
                    "3/4 cup of water",
                    "3 saffron threads (Optional)"
                ],
                "process": [
                    "Make 4 to 5 slits in mangoes.",
                    "Microwave on High for 1 to 2 minutes until soft.",
                    "Allow mangoes to cool, then remove peel and seed.",
                    "Place mango pulp in a bowl and mash well with a fork or potato masher.",
                    "Stir sugar and water in a saucepan over low heat.",
                    "Bring to a boil, increasing heat to medium-high until soft threads form (270°F / 135°C).",
                    "Stir in mango pulp, add saffron threads.",
                    "Boil for about 5 minutes until the mixture thickens.",
                    "Pour the cooked jam into sterilized jars and seal accordingly."
                ],
                "src": "https://www.allrecipes.com/recipe/142747/mango-jam/"
            },
            "juice": {
                "name": "Mango Juice",
                "description": "Mango juice is a delicious beverage crafted from the pulpy goodness of ripe mangoes.",
                "ingredients": [
                    "3 medium mango",
                    "3 tablespoons of sugar",
                    "1 1/2 to 2 cups of chilled water",
                    "5 to 6 mint leaves (Optional)",
                    "1-inch ginger (Optional)",
                    "1 lemon or lime (Optional)",
                    "2 teaspoons of chie seeds (Optional)"
                ],
                "process": [
                    "Wash the mangoes and chill them in the fridge.",
                    "Peel the mangoes, and slice into cubes before adding to a blender",
                    "Pour the water or coconut water, sugar, and ice cubes.",
                    "(Optional) Put in the other ingredients.",
                    "Blend until smooth, and serve immediately."
                ],
                "src": "https://www.indianhealthyrecipes.com/mango-juice-recipe/"
            },
            "drying": {
                "name": "Dried Mangoes",
                "description": "A delightful snack made by dehydrating mango slices, resulting in a chewy and concentrated burst of natural mango flavor.",
                "ingredients": [
                    "1lb of mangoes"
                ],
                "process": [
                    "If using frozen mango, thaw, peel, and cut into 1/2-inch cubes.",
                    "Place mango on dehydrator trays, using a mesh liner if needed.",
                    "Set dehydrator to 135°F / 57°C.",
                    "Dehydrate for 8-10 hours until dry and pliable.",
                    "Allow the dried mango to cool completely before storing.",
                    "For long-term storage, condition the dried mango in a transparent, airtight container. Shake occasionally to prevent sticking.",
                    "After conditioning, store the dried mango in an airtight container in a cool, dark place for up to a year."
                ],
                "src": "https://www.freshoffthegrid.com/dried-mango/"
            }
        }
    },
    "watermelon": {
        "name": "Watermelon (Pakwan)",
        "iconName": "Watermelon",
        "binomial": "Citrullus lanatus",
        "type": "Fruit",
        "season": ["March", "April", "May", "June"],
        "nutrients": {
            "Calories": "46",
            "Fat": "0.2g",
            "Sodium": "1.5mg",
            "Carbohydrates": "11.5g",
            "Fiber": "0.6g",
            "Sugar": "9.4g",
            "Protein": "0.9g",
            "Vitamin C": "12.3mg",
            "Vitamin A": "42.6mcg",
            "Lycopene": "6890mcg",
            "src": "https://www.verywellfit.com/nutrition-facts-and-watermelon-carbs-1087575"
        },
        "preservation": {
            "jam": {
                "name": "Watermelon Jam",
                "description": "Sweet and vibrant jam made from fresh watermelon, sugar, and a hint of lemon. Perfect for spreading on toast or enhancing desserts.",
                "ingredients": [
                    "2 cups of pureed watermelon",
                    "1/4 cup of fresh lemon juice",
                    "2 cups of white sugar",
                    "6 tablespoons of powdered pectin"
                ],
                "process": [
                    "Combine pureed watermelon, lemon juice, and sugar in a pot.",
                    "Bring the mixture to a rolling boil, then reduce the heat to simmer.",
                    "Add pectin and immediately whisk to dissolve it smoothly.",
                    "Bring the jam to a boil again, then simmer for 20 minutes, stirring regularly.",
                    "Pour the watermelon jam into a mason jar.",
                    "Allow the jam to cool; it will set completely during the cooling process.",
                    "Store the watermelon jam in the refrigerator for up to 1 month or consider canning for longer preservation."
                ],
                "src": "https://www.melaniecooks.com/watermelon-jam/16566/"
            },
            "pickle": {
                "name": "Watermelon Pickle",
                "description": "Tangy and crisp watermelon rind pickles, brined with vinegar, sugar, and spices. A unique and delightful treat with a hint of sweetness.",
                "ingredients": [
                    "2lbs of watermelon rind",
                    "1/4 cup of pickling salt",
                    "4 cups of water",
                    "2 cups of granulated sugar",
                    "1 cup of white vinegar",
                    "1 tablespoon of cinnamon stick",
                    "1 1/ teaspoons of whole cloves",
                    "1/2 lemon, thinly sliced",
                    "5 maraschino cherries (Optional)"
                ],
                "process": [
                    "Trim the dark green and pink parts from the watermelon rind, and discard them.",
                    "Cut the rind into 1-inch cubes, measuring out 7 cups.",
                    "Place the cubes in a large container with pickling salt and 3 cups of water.",
                    "Soak overnight; drain and rinse the watermelon rind.",
                    "Cover the rind with cold water in a large saucepan. Simmer until just tender, approximately 10 minutes.",
                    "In a Dutch oven, combine sugar, vinegar, cinnamon, whole cloves, and 1 cup of water. Simmer the mixture for 10 minutes.",
                    "Add drained watermelon rind, lemon slices, and maraschino cherries (if using) to the spiced syrup. Simmer until the watermelon rind is translucent, about 30 minutes.",
                    "Fill half-pint jars with the hot watermelon rind and syrup mixture, leaving 1/2 inch of headspace. Add the lids.",
                    "Process the jars in a boiling water bath for 5 minutes.",
                    "Remove the jars from the water bath and let them cool on a rack.",
                    "Once cooled, the pickled watermelon rind is ready to serve and enjoy."
                ],
                "src": "https://www.thespruceeats.com/watermelon-rind-pickles-recipe-3059156"
            },
            "dehydration": {
                "name": "Dehydration",
                "description": "Crispy watermelon chips created by dehydrating fresh slices. A portable and flavorful snack with concentrated watermelon goodness.",
                "ingredients": [
                    "1 seedless watermelon"
                ],
                "process": [
                    "Wash the outside of the watermelon and pat it dry.",
                    "Cut the watermelon in half and then into quarters.",
                    "Carefully cut the watermelon off the rind.",
                    "Cut each slice into 1/2-inch pieces.",
                    "Lay each watermelon piece on a dehydrator tray.",
                    "Dehydrate the watermelon for 12-16 hours at 135 degrees F.",
                    "After 12 hours, check the watermelon to ensure it is very thin but still pliable. Adjust the drying time if needed."
                ],
                "src": "https://www.cleaneatingkitchen.com/dehydrated-watermelon-recipe/"
            },
            "freezing": {
                "name": "Freezing",
                "description": "Juicy watermelon cubes flash-frozen for a refreshing and cooling experience. Ideal for adding a burst of summer to smoothies or enjoying as a frosty treat.",
                "ingredients": [
                    "Watermelon"
                ],
                "process": [
                    "Arrange cut watermelon on a sheet pan lined with parchment paper.",
                    "Ensure pieces are not touching to prevent freezing together. Remove any black seeds during the process.",
                    "Line the pan with parchment paper to prevent sticking.",
                    "Freeze the watermelon until firm, typically taking a few hours.",
                    "Once firm, transfer the frozen watermelon to an airtight container for longer storage."
                ],
                "src": "https://detoxinista.com/frozen-watermelon/"
            }
        }
    },
    "cantaloupe": {
        "name": "Cantaloupe (Melon)",
        "iconName": "Cantaloupe",
        "binomial": "Cucumis melo var. cantalupensis",
        "type": "Fruit",
        "season": ["April", "May", "June", "July"],
        "nutrients": {
            "Calories": "188",
            "Protein": "4.64g",
            "Fat": "1.05g",
            "Carbohydrates": "45g",
            "Fiber": "4.97g",
            "Sugar": "43.4g",
            "Calcium": "49.7mg",
            "Magnesium": "66.2mg",
            "Phosphorus": "82.8mg",
            "Potassium": "1470mg",
            "Vitamin C": "203mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/169092/nutrients"
        },
        "preservation": {
            "jam": {
                "name": "Melon Jam",
                "description": "Experience the essence of ripe cantaloupe in a delightful jam, perfect for spreading on breakfast toast or adding a sweet touch to desserts.",
                "ingredients": [
                    "1kg of cantaloupe",
                    "2 cups of granulated sugar",
                    "Juice of 1 lemon"
                ],
                "process": [
                    "Cut the melon into slices, removing seeds and skin, and chop the flesh into 1-inch cubes. Combine with sugar and lemon, allowing it to macerate for 6 hours or overnight.",
                    "Place a saucer in the freezer for later use in testing the jam setting.",
                    "Transfer the macerated melon and its juices to a large pot. Bring it to a rapid boil, cooking for about 25 minutes or until the jam sets. Stir often to prevent sticking or burning.",
                    "To check for setting, place a blob of hot jam on the cold saucer. Wait for it to cool and observe if it wobbles, slides slowly when tilted, and wrinkles slightly when poked. Adjust cooking accordingly.",
                    "If desired, mash or blend the jam for a smoother texture. Spoon it into sterilized jars and either process them or seal and refrigerate. Refrigerated jam should be consumed within a couple of weeks once opened."
                ],
                "src": "https://food52.com/recipes/60711-melon-jam"
            },
            "pickle": {
                "name": "Melon Pickle",
                "description": "Transform cantaloupe into tangy pickles, blending sweet and sour flavors for a unique twist that complements salads and savory dishes.",
                "ingredients": [
                    "1lb honeydew melon",
                    "2 fresh thyme sprigs",
                    "Fruit pickle brine"
                ],
                "process": [
                    "Cut the melon into chunks.",
                    "Place the melon chunks and thyme sprigs in a 24-oz. jar with a tight-fitting lid.",
                    "Pour Fruit Pickle Brine over the melon in the jar.",
                    "Seal the jar and chill the melon in the refrigerator for 1 to 12 hours.",
                    "Store the jar in the refrigerator for up to 1 week."
                ],
                "src": "https://www.myrecipes.com/recipe/pickled-melon"
            },
            "ice_cream": {
                "name": "Ice Cream",
                "description": "Indulge in the cool and creamy goodness of homemade cantaloupe ice cream, capturing the refreshing taste of summer in every scoop.",
                "ingredients": [
                    "2 cups of diced melon",
                    "Egg yolks",
                    "Granulated sugar",
                    "Whole milk",
                    "Heavy cream",
                    "Kosher salt",
                    "Vanilla extract"
                ],
                "process": [
                    "Blend cantaloupe until smooth.",
                    "Strain puree, discarding fibrous pulp.",
                    "Whisk egg yolks with sugar until pale.",
                    "Simmer milk in a saucepan; avoid boiling.",
                    "Temper egg mixture with hot milk, then combine in the saucepan. Heat on low until the base thickens.",
                    "Strain mixture, removing any cooked egg pieces.",
                    "Add heavy cream and vanilla, stir, and cover. Refrigerate until cold.",
                    "Stir cantaloupe puree into the chilled mixture.",
                    "Churn according to the ice cream machine's instructions until soft-serve consistency.",
                    "Transfer to a container, cover, and freeze for at least 4 hours before serving."
                ],
                "src": "https://icecreamfromscratch.com/melon-ice-cream/"
            },
            "salsa": {
                "name": "Cantaloupe Salsa",
                "description": "Elevate your culinary experience with a vibrant cantaloupe salsa, blending the juiciness of cantaloupe with savory spices.",
                "ingredients": [
                    "2 cups of diced melon",
                    "1 cup of diced cucumber",
                    "1/2 cup of finely chopped red onion",
                    "1 serrano chile",
                    "1/2 cup of chopped cilantro",
                    "3 tablespoons of lime juice",
                    "1 tablespoon of vegetable oil",
                    "1 teaspoon of kosher salt"
                ],
                "process": [
                    "Mix all ingredients together in a medium bowl.",
                    "Consume up to 1 day, covered and chilled."
                ],
                "src": "https://www.myrecipes.com/recipe/melon-salsa"
            }
        }
    },
    "avocado": {
        "name": "Avocado",
        "iconName": "Avocado",
        "binomial": "Persea americana",
        "type": "Fruit",
        "season": ["May", "June", "July", "August", "September"],
        "nutrients": {
            "Calories": "240",
            "Carbohydrates": "13g",
            "Protein": "3g",
            "Fat": "22g",
            "Fiber": "10g",
            "Sodium": "11mg",
            "src": "https://www.hsph.harvard.edu/nutritionsource/avocados/#:~:text=A%20whole%20medium%20avocado%20contains,fiber%2C%20and%2011%20milligrams%20sodium."
        },
        "preservation": {
            "pickle": {
                "name": "Pickled Avocado",
                "description": "Create a unique twist with pickled avocados. Combine avocado slices with a tangy mixture of vinegar, water, sugar, and spices for a flavorful and zesty addition to salads or sandwiches.",
                "ingredients": [
                    "2-3 under-ripe avocados",
                    "1 cup of distilled white vinegar",
                    "1 cup of sugar",
                    "1 cup of salt",
                    "1 cup of garlic cloves",
                    "1 cup of ref pepper flakes",
                    "1 cup of water"
                ],
                "process": [
                    "Slice avocados into thin strips, aiming for about 4 slices per avocado half.",
                    "Heat liquids with salt and sugar to dissolve them. Add garlic and red pepper flakes to a jar.",
                    "Place avocado slices in the jar and pour the pickling liquid over them.",
                    "Allow to cool, then refrigerate for at least 30 minutes, preferably 2-3 hours.",
                    "Enjoy the pickles directly from the fridge for up to 2-3 weeks, depending on the avocado ripeness."
                ],
                "src": "https://urbanfarmie.com/pickled-avocado/"
            },
            "puree": {
                "name": "Avocadoo Puree",
                "description": "Experience the creamy goodness of avocados in a versatile puree. Blend ripe avocados into a smooth consistency, ideal for adding richness to smoothies, sauces, or as a base for dips.",
                "ingredients": [
                    "Ripe avocado",
                    "Fresh lemon"
                ],
                "process": [
                    "Halve a ripe avocado, remove the pit, and scoop out the flesh. Discard the peels.",
                    "Add the avocado flesh to a blender or a small food processor.",
                    "Blend, adjusting the consistency with breastmilk, formula, or water if desired. You can also add a little fresh lemon to prevent discoloration.",
                    "Serve the puree immediately or refrigerate inside a sealed container."
                ],
                "src": "https://www.yummytoddlerfood.com/easy-avocado-puree/"
            }
        }
    },
    "cotton_fruit": {
        "name": "Cotton Fruit (Santol)",
        "iconName": "Cotton Fruit",
        "binomial": "Sandocirum koetjape",
        "type": "Fruit",
        "season": ["May", "June", "July"],
        "nutrients": {
            "Calories": "80",
            "Carbohydrates": "20.9g",
            "Fiber": "0.9g",
            "Sugar": "20g",
            "Protein": "0.6g",
            "Fat": "0.1g",
            "Vitamin C": "20mg",
            "Calcium": "20mg",
            "Phosphorus": "14mg",
            "Iron": "0.6mg",
            "Potassium": "37mg",
            "src": "https://agraryo.com/food/santol-10-health-benefits-of-cotton-fruit-and-side-effects/"
        },
        "preservation": {
            "preserve": {
                "name": "Santol Preserve",
                "description": "Santol pieces cooked with sugar to create a sweet and flavorful preserve. Ideal for spreading on toast or as a dessert topping.",
                "ingredients": [
                    "Ripe santol",
                    "Water",
                    "Sugar"
                ],
                "process": [
                    "Select ripe santol, wash, and blanch in boiling water for 10 minutes. Thinly peel and soak the santol in cold water.",
                    "Cut santol into halves, remove seeds, and soak in water for three days, changing the water daily. Wash again and blanch in boiling water for 10 minutes. Dip in cold water and drain.",
                    "Boil santol in a syrup made of two parts sugar and one part water for 15 minutes. Let it stand overnight.",
                    "Boil the syrup without santol until thickened. Add santol and continue boiling. Pack in 12-ounce preserving jars, filling with syrup. Remove air bubbles, half-seal, and sterilize jars in boiling water for 20 minutes. Finally, seal completely."
                ],
                "src": "https://www.kawalingpinoyrecipe.com/fruit_preserves/santol_preserve.htm"
            },
            "pickle": {
                "name": "Santol Pickle",
                "description": "Santol wedges immersed in a tangy pickling solution with vinegar, sugar, salt, and spices. A zesty and savory condiment to complement various dishes.",
                "ingredients": [
                    "12 santol",
                    "1 cup of raisins",
                    "1 cup of red and green bell peppers",
                    "1 whole garlic",
                    "2 cups of vinegar",
                    "Ginger",
                    "Sugar",
                    "Salt"
                ],
                "process": [
                    "Boil whole Santol fruits for approximately 10 minutes. Allow them to cool.",
                    "Wash, peel, deseed, and remove all white pulp. Cut the Santol into very thin strips or use rough grating for a preferred texture.",
                    "In a bowl, combine garlic, ginger, onions, bell peppers, santol strips, and raisins.",
                    "Sterilize the jar(s) and allow them to dry.",
                    "Add vinegar, salt, and sugar to the santol mix. Adjust the ratio based on your preference for sourness and sweetness.",
                    "Place the Santol pickle mix in the sterilized jars. Proceed to water bath canning.",
                    "Perform the water bath canning process to preserve the Santol pickle.",
                    "After water bath canning, store the jars in the refrigerator, esky, or a cool dry pantry. Allow the pickle to age for about three days before consumption."
                ],
                "src": "https://tropicalfruitforum.com/index.php?topic=18967.0"
            },
            "jam": {
                "name": "Santol Jam",
                "description": "Santol pulp simmered with sugar until it reaches a thick, spreadable consistency. A delightful jam for adding a sweet twist to snacks and desserts.",
                "ingredients": [
                    "Santol",
                    "White sugar",
                    "Dark muscavado sugar",
                    "Lime juice",
                    "Water"
                ],
                "process": [
                    "Peel santol, discard seeds, and soak the flesh in water in the fridge for at least 24 hours, changing the water once or twice.",
                    "Drain soaked santol and boil in water for 8-12 minutes until softened. Drain again, reserving 4-6 cups of boiling water.",
                    "Pass santol through a food mill or use a food processor to create a grainy puree. If dry, add 2-3 cups of reserved santol water.",
                    "Weigh the puree and add an equivalent amount of white sugar. Add dark muscovado sugar and lime juice (or kalamansi juice).",
                    "Use a heavy-bottomed pot. Stir occasionally over high heat until all ingredients blend and melt. Adjust sweetness to taste.",
                    "Sterilize jars by placing them in boiling water. Dry the bottles.",
                    "When the jam is ready (after 12-15 minutes), add the hot jam to the dry bottles. Seal and boil in water for another 12 minutes for long-term preservation.",
                    "If consuming within a month, no heat treatment is needed. Refrigerate once cooled. Enjoy the santol jam with cheese, crackers, or in pan de sal with butter."
                ],
                "src": "https://www.marketmanila.com/archives/santol-jam-a-la-marketman"
            }
        }
    },
    "lychee": {
        "name": "Lychee",
        "iconName": "Lychee",
        "binomial": "Litchi chinensis",
        "type": "Fruit",
        "season": ["May", "June", "July", "August"],
        "nutrients": {
            "Calories": "6.34",
            "Protein": "0.08g",
            "Fat": "0.042g",
            "Carbohydrates": "1.58g",
            "Fiber": "0.125g",
            "Sugar": "1.46g",
            "Phosphorus": "2.98mg",
            "Potassium": "16.4mg",
            "Vitamin C": "6.86mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/169086/nutrients"
        },
        "preservation": {
            "jam": {
                "name": "Lychee Jam",
                "description": "A sweet and fragrant spread made from ripe lychees, sugar, and a hint of lemon juice, creating a delightful jam perfect for breakfast or desserts.",
                "ingredients": [
                    "700g of fresh lychee",
                    "350g of sugar",
                    "20-30 lemon or lime seeds",
                    "1 lime"
                ],
                "process": [
                    "Peel and deseed lychees, then blend in a food processor until mostly liquid, leaving some small lychee pieces.",
                    "Place the blended lychee in a medium-sized pot, add sugar, and squeeze the juice of one lime. Place lemon/lime seeds and the squeezed lime into a small linen bag, tie it, and add it to the pot. Cook over medium-low heat for around 15 minutes or until the temperature reaches 220°F or passes the jam readiness test.",
                    "Once the jam is ready, remove it from heat, extract the bag of seeds (squeezing out any jam), and let it cool to room temperature. Pour the cooled jam into a sterilized jar and store it in the fridge. Consume within 2-3 weeks. Enjoy!"
                ],
                "src": "https://www.thehongkongcookery.com/2018/07/lychee-jam.html"
            },
            "syrup": {
                "name": "Syrup",
                "description": "Plump lychee fruits preserved in a light syrup solution, enhancing their natural sweetness and allowing for extended shelf life, ideal for diverse culinary uses.",
                "ingredients": [
                    "1kg fresh lychee",
                    "1 cup of sugar",
                    "2 cups of water",
                    "Crushed ice"
                ],
                "process": [
                    "Peel and deseed the lychees.",
                    "In a large cooking pan, combine sugar and water. Bring to a boil without stirring to prevent crystallization. Lower heat to simmer until sugar dissolves and liquid becomes clear.",
                    "Stir in the lychees when the sugar syrup is ready. Cook until lychees are tender (1-2 minutes).",
                    "Remove from heat and let it cool.",
                    "Serve lychees with the syrup, either chilled or with crushed ice.",
                    "Store any leftovers in a tightly covered container in the refrigerator."
                ],
                "src": "https://lifestyle.inquirer.net/364470/preserving-fresh-lychees-in-syrup/"
            },
            "preserve": {
                "name": "Lychee Preserve",
                "description": "Whole lychee fruits cooked in a flavorful syrup, resulting in a luscious preserve that captures the essence of lychee, versatile for pairing with desserts or enjoying on its own.",
                "ingredients": [
                    "5 cups of lychee",
                    "3 cups of sugar",
                    "1 cup of orange",
                    "1 cup of raisins",
                    "1 orange",
                    "1 cup of chopped pecans",
                    "1 teaspoon fresh grated ginger"
                ],
                "process": [
                    "In a large pot, combine all ingredients except for pecans.",
                    "Bring the mixture to a boil, stirring until sugar is dissolved.",
                    "Cook rapidly, almost to the gelling point, for about 15 minutes at a rolling boil while continuously stirring.",
                    "Add pecans and continue to cook and stir for an additional 5 minutes.",
                    "Pour the mixture into hot jars, leaving 1/4 inch headspace. Remove air bubbles and adjust the caps.",
                    "Process the jars for 15 minutes in a boiling water canner. Ensure that the tops of the jars are covered by at least an inch of water.",
                    "Allow the jars to cool at room temperature.",
                    "Store in your cabinet. Chill the preserves after opening."
                ],
                "src": "https://www.food.com/recipe/lychee-conserve-112764"
            }
        }
    },
    "pineapple": {
        "name": "Pineapple (Pinya)",
        "iconName": "Pineapple",
        "binomial": "Ananas comosus",
        "type": "Fruit",
        "season": ["May", "June", "July"],
        "nutrients": {
            "Calories": "42",
            "Carbohydrates": "11g",
            "Protein": "0.454g",
            "Fat": "0.101g",
            "Sugar": "8.27g",
            "Fiber": "1.18g",
            "Potassium": "91.6mg",
            "Calcium": "10.9mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/169124/nutrients"
        },
        "preservation": {
            "canning": {
                "name": "Canned Pineapple",
                "description": "Sun-kissed pineapple chunks preserved in a can, ready to add a burst of tropical flavor to your dishes, desserts, or enjoyed straight from the can.",
                "ingredients": [
                    "6 whole large pineapples",
                    "1 cup of sugar",
                    "5 cups of water"
                ],
                "process": [
                    "In a large stainless steel pot, dissolve 1 cup of sugar in 5 cups of water. Bring to a boil, stirring constantly until sugar is dissolved. Reduce heat to medium-low, add pineapple chunks, and heat for 10 minutes.",
                    "Use a slotted spoon to pack hot pineapple chunks into jars, leaving a ½ inch headspace. Ladle hot syrup into jars, covering the pineapple chunks while maintaining a ½ inch headspace.",
                    "Eliminate air bubbles by running a butter knife along the inside of the jar. Adjust headspace if needed. Wipe the rim, place lids, screw bands, and submerge jars in the canner. Ensure jars are completely covered in water.",
                    "Bring water to a boil and process pint jars for 15 minutes or quart jars for 20 minutes. After processing, turn off the heat, remove canner lid, let sit for 5 minutes, then remove jars and allow them to cool completely before storing in a cool, dark place."
                ],
                "src": "https://2blissofbaking.com/canned-pineapple-recipe/"
            },
            "dehydration": {
                "name": "Dehydrated Pineapple",
                "description": "Pineapple slices dehydrated to perfection, creating a chewy and naturally sweet snack, perfect for on-the-go or as a versatile ingredient in recipes.",
                "ingredients": [
                    "2lbs of pineapple"
                ],
                "process": [
                    "Remove the skin, core, and cut into 1/2-inch pieces for quicker drying.",
                    "Dehydrate at 135°F / 57°C for 10-18 hours until dry.",
                    "Allow the dried pineapple to cool completely before storing.",
                    "For long-term storage, condition the dried pineapple by loosely packing it in an airtight container. Leave on the counter for a week, checking daily for signs of moisture. If condensation appears, return it to the dehydrator (unless there are signs of mold—discard). Shake occasionally to prevent sticking.",
                    "After conditioning, store in an airtight container in a cool, dark place for up to a year. Vacuum sealing will enhance shelf life and quality."
                ],
                "src": "https://www.freshoffthegrid.com/dehydrating-pineapple/"
            },
            "ice_cream": {
                "name": "Pineapple Sorbet",
                "description": "A refreshing frozen treat made from pureed pineapples, offering a delightful balance of sweetness and tanginess in every spoonful.",
                "ingredients": [
                    "1 large pineapple",
                    "1 tablespoon of freshly squeezed lime juice"
                ],
                "process": [
                    "Line a baking sheet with parchment paper.",
                    "Cut pineapple into cubes and spread them on the baking sheet, ensuring space between cubes.",
                    "Freeze overnight or at least 3-4 hours until completely frozen.",
                    "Place frozen pineapple in a food processor and let it thaw for 10-15 minutes until it softens. Pulse until the pineapple becomes crumbly.",
                    "Add lime juice and pulse again. Adjust consistency by adding warm water if needed for a soft serve texture.",
                    "Serve immediately. For later use, store in the freezer in an airtight container for up to 2 weeks."
                ],
                "src": "https://www.asweetpeachef.com/pineapple-sorbet/"
            },
            "syrup": {
                "name": "Pineapple Syrup",
                "description": "Liquid gold crafted from simmered pineapple juice and sugar, this syrup is a versatile sweetener, ideal for enhancing beverages, desserts, or drizzling over pancakes.",
                "ingredients": [
                    "1 cup of water",
                    "3/4 cup of granulated sugar",
                    "1 cup of chopped pineapple"
                ],
                "process": [
                    "In a medium-sized saucepan, combine water, sugar, and pineapple.",
                    "Bring the mixture to a boil.",
                    "Lower the heat and let the mixture simmer for approximately 15 minutes until it thickens, and the pineapple breaks down.",
                    "Strain the mixture into a bowl, pressing down on the pineapple to extract maximum juice.",
                    "Keep the syrup in the bowl or transfer it to a mason jar.",
                    "Place it in the fridge to cool completely before use. The syrup will continue to thicken as it cools."
                ],
                "src": "https://wearenotmartha.com/pineapple-syrup/"
            }
        }
    },
    "durian": {
        "name": "Durian",
        "iconName": "Durian",
        "binomial": "Durio zibethinus",
        "type": "Fruit",
        "season": ["July", "August", "September", "October"],
        "nutrients": {
            "Calories": "357",
            "Fat": "13g",
            "Sodium": "4.9mg",
            "Carbohydrates": "66g",
            "Fiber": "9.2g",
            "Protein": "3.6g",
            "Potassium": "1060mg",
            "Phosphorus": "94.8mg",
            "Magnesium": "72.9mg",
            "Vitamin C": "47.9mg",
            "Folate": "87.5mcg",
            "src": "https://www.verywellfit.com/durian-fruit-nutrition-facts-4588715"
        },
        "preservation": {
            "candy": {
                "name": "Durian Pastillas",
                "description": "Durian pastillas are sweet, milky candies made by combining durian puree with condensed milk and sugar. These soft and chewy treats offer a delightful way to enjoy the unique flavor of durian.",
                "ingredients": [
                    "3 cups of durian pulp",
                    "2 cups of powdered milk",
                    "5 cups of refined sugar",
                    "1 can of condensed milk",
                    "2 tablespoons of butter",
                    "2 tablespoon of glucose"
                ],
                "process": [
                    "Combine durian pulp, powdered milk, refined sugar, and condensed milk in a stainless carajay/pan.",
                    "Cook the mixture over low heat, stirring constantly until it thickens enough to be rolled.",
                    "Transfer the thickened mixture to a board, apply butter, spread to the desired thickness, and cut into serving sizes. Allow it to cool.",
                    "Individually wrap the pieces in water cellophane and pack for storage."
                ],
                "src": "https://pinoynegosyo.blogspot.com/2014/05/how-to-make-durian-pastillas-and-candy.html"
            },
            "ice_cream": {
                "name": "Ice Cream",
                "description": "Durian ice cream is a frozen dessert that captures the rich and creamy essence of durian. Blended with cream, sugar, and sometimes milk, this ice cream provides a cool and satisfying way to experience the distinctive taste of durian.",
                "ingredients": [
                    "7oz of durian pulp",
                    "1/3 cup of condensed milk",
                    "1 1/2 cups of heavy cream"
                ],
                "process": [
                    "In a high-power blender, combine durian pulp and condensed milk. Blend until the mixture is smooth.",
                    "Pour in the cream and blend on low speed until well combined. Scrape down the sides if necessary. Increase the speed to medium-high and blend briefly until the ice cream base is thick and fluffy (about 10-15 seconds).",
                    "Transfer the durian ice cream base into a freezer-safe container, such as a glass Pyrex or a small loaf pan. Smooth out the top, cover, and freeze for at least 4 hours or overnight.",
                    "When ready to enjoy, allow the ice cream to warm up slightly at room temperature for easier scooping. Enjoy!"
                ],
                "src": "https://twoplaidaprons.com/durian-ice-cream-no-churn/"
            },
            "paste": {
                "name": "Durian Paste",
                "description": "Durian paste is a thick and concentrated durian mixture made by cooking durian flesh with sugar. This versatile paste can be used as a filling for various pastries, desserts, or added to dishes to impart the intense flavor of durian.",
                "ingredients": [
                    "1 tablespoon of oil",
                    "450g of durian flesh",
                    "220g castor sugar",
                    "60g of oil"
                ],
                "process": [
                    "Heat one tablespoon of oil in a nonstick saucepan. Add durian flesh and sugar. Stir and cook until the mixture becomes dry.",
                    "Gradually add 60g of oil to the mixture.",
                    "Stir continuously over very low heat until the paste is dry.",
                    "Dish out the durian paste and let it cool completely."
                ],
                "src": "https://www.kuali.com/recipe/sauces-and-condiments/durian-paste/"
            }
        }
    },
    "velvet_apple": {
        "name": "Velvet Apple (Mabolo)",
        "iconName": "Velvet Apple",
        "binomial": "Diospyros blancoi",
        "type": "Fruit",
        "season": ["July", "August"],
        "nutrients": {
            "Calories": "70",
            "Carbohydrates": "20g",
            "Sugar": "15g",
            "Fiber": "5g",
            "Protein": "1g",
            "src": "https://agraryo.com/food/velvet-apple-8-health-benefits-of-mabolo-and-side-effects/"
        },
        "preservation": {
            "juice": {
                "name": "Smoothie",
                "description": "Fresh velvet apples are peeled and juiced to create a sweet and refreshing beverage. Enjoy the smooth and velvety texture of this unique fruit in liquid form, perfect for a natural and nutritious drink.",
                "ingredients": [
                    "1 velvet apple",
                    "3 small bananas",
                    "1/4 teaspoon of vanilla",
                    "1 cup of coconut milk"
                ],
                "process": [
                    "Blend all ingredients together using a blender.",
                    "Serve and enjoy!"
                ],
                "src": "http://livingadeliciouslife.blogspot.com/2015/05/velvet-apple-mabolo-smoothie.html"
            },
            "butter": {
                "name": "Butter",
                "description": "A luscious spread made from velvet apples, sugar, and a hint of limejuice. The fruit's natural sweetness is concentrated into a smooth and velvety butter, perfect for spreading on toast or incorporating into various dishes.",
                "ingredients": [
                    "Velvet apples",
                    "Sugar",
                    "Lime juice"
                ],
                "process": [
                    "Peel and chop velvet apples.",
                    "In a pot, simmer the chopped fruit in water with limejuice until soft.",
                    "Remove from heat and blend the softened fruit with sugar.",
                    "Adjust sugar quantity to 1 cup for every 6 cups of fruit.",
                    "Blend until smooth to create delicious velvet apple butter."
                ],
                "src": "https://www.fruitsinfo.com/Velvet-apple-Fruit-Exotic-fruits.php"
            }
        }
    },
    "hairy_lychee": {
        "name": "Hairy Lychee (Rambutan)",
        "iconName": "Hairy Lychee",
        "binomial": "Nephelium lappaceum",
        "type": "Fruit",
        "season": ["August", "September", "October"],
        "nutrients": {
            "Calories": "123",
            "Fat": "0.3g",
            "Sodium": "16.5mg",
            "Carbohydrates": "31.3g",
            "Fiber": "1.4g",
            "Protein": "1g",
            "Manganese": "0.5mg",
            "Copper": "0.1mg",
            "src": "https://www.verywellfit.com/rambutan-nutrition-facts-4690810"
        },
        "preservation": {
            "juice": {
                "name": "Rambutan Smoothie",
                "description": "A refreshing blend of ripe rambutan, ice, and a splash of your favorite juice, creating a tropical and hydrating smoothie.",
                "ingredients": [
                    "4 rambutans",
                    "50g of pineapple",
                    "70ml canned coconut milk",
                    "100ml of coconut water or plain water"
                ],
                "process": [
                    "Score the outer shell, make a slit, and tear open the rambutan. Remove the fruit, discarding the skin.",
                    "Cut the pulp around the seed, discarding the papery coating.",
                    "Cut pineapple into wedges, removing the tough core, and chop into chunks.",
                    "Place prepared rambutans and pineapple chunks in a blender.",
                    "Add tinned coconut milk and water or coconut water.",
                    "Blend until smooth, then pour into a glass to enjoy your exotic rambutan smoothie!"
                ],
                "src": "https://foodaciously.com/recipe/rambutan-smoothie"
            },
            "jam": {
                "name": "Rambutan Jam",
                "description": "A sweet and tangy spread made from succulent rambutan, sugar, and a hint of citrus, perfect for spreading on toast or adding a fruity twist to desserts.",
                "ingredients": [
                    "24oz of fresh rambutan",
                    "1 tablespoon of water",
                    "1 teaspoon of cornstarch",
                    "2 tablespoons of sugar",
                    "1 drop of green food dye",
                    "1 cinnamon stick"
                ],
                "process": [
                    "Cut open each rambutan. Remove the fruit from inside by slicing it in half and extracting the inner seed. Repeat the process for all rambutans.",
                    "Place the rambutan fruit flesh into a blender.",
                    "Pour the pureed rambutan into a small saucepan.",
                    "Add cornstarch, sugar, food dye, and a cinnamon stick.",
                    "Bring the mixture to a boil.",
                    "Reduce the heat to a simmer and let it simmer for 5 minutes.",
                    "Remove the saucepan from heat.",
                    "Serve and enjoy!"
                ],
                "src": "https://fruitsandveggies.org/recipes/rambutan-jam/"
            },
            "martini": {
                "name": "Rambutan Martini",
                "description": "A tropical and exotic martini featuring the juicy and vibrant flavors of rambutan, combined with your preferred spirit for a delightful cocktail experience.",
                "ingredients": [
                    "1/4 cup of sugar",
                    "1/4 cup of water",
                    "8 fresh rambutans",
                    "4oz vodka",
                    "2 teaspoons of lime juice",
                    "1/2 teaspoon vanilla",
                    "1 cup of ice"
                ],
                "process": [
                    "In a small saucepan, combine sugar and water.",
                    "Heat over medium-high heat until the sugar dissolves.",
                    "Pour the simple syrup into a bowl to cool.",
                    "Peel and pit the rambutans. Peel gently, removing the skin in a few pieces.",
                    "Carefully remove the pit from the fruit, leaving the thin white layer.",
                    "Place peeled rambutans in a cocktail shaker.",
                    "Add vodka, lime juice, vanilla, ice, and cooled simple syrup.",
                    "Cover and shake vigorously for about 30 seconds.",
                    "Strain the mixture into two martini glasses.",
                    "Garnish each glass with a small lime wedge and part of the rambutan skin.",
                    "Use a paring knife to make a small slit in each for attaching it to the rim of the glass."
                ],
                "src": "https://cookingontheweekends.com/rambutini/"
            },
            "pickle": {
                "name": "Rambutan Pickle",
                "description": "Tangy and flavorful rambutan pickles, prepared with a blend of spices and vinegar, offering a unique twist to your pickle collection.",
                "ingredients": [
                    "20 rambutans",
                    "1 tablespoon of ginger and garlic",
                    "2 green chilly",
                    "3 chilly flakes",
                    "1/2 teaspoon of turmeric powder",
                    "1 teaspoon of fenugreek powder",
                    "1 teaspoon of hing powder",
                    "1 teaspoon of cumin powder",
                    "Salt, as needed",
                    "1 tablespoon of curry leaves",
                    "2 tablespoon of gingelly oil or coconut oil",
                    "2 1/2 tablespoons of kashmiri chilly powder",
                    "1 cup of water",
                    "1 teaspoon of jaggery powder",
                    "1 teaspoon of mustard"
                ],
                "process": [
                    "Peel the hairy part of the rambutan fruit, and wash the white fruit with water.",
                    "Heat a pan and pour oil.",
                    "Add mustard; when it splutters, add chili flakes, chopped ginger, chopped garlic, green chili pieces, and curry leaves.",
                    "Stir on medium flame for 2 minutes.",
                    "Add Kashmiri chili powder and turmeric powder.",
                    "Stir well, add water and salt, stir until absorbed.",
                    "Add cumin powder, fenugreek powder, and asafoetida.",
                    "Stir, add rambutan fruit, and mix well.",
                    "Stir on low heat for 2 minutes.",
                    "Sprinkle jaggery powder and mix well. Remove from heat.",
                    "Transfer to a serving bowl.",
                    "Serve with rice and other dishes.",
                    "Once cooled, store in a steel or glass container."
                ],
                "src": "https://cookpad.com/in/recipe/images/df7d468214a15999"
            }
        }
    },
    "lanzones": {
        "name": "Lanzones",
        "iconName": "Lanzones",
        "binomial": "Lansium parasiticum",
        "type": "Fruit",
        "season": ["August", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "57",
            "Fat": "0g",
            "Cholesterol": "0g",
            "Fiber": "0.8g",
            "Calcium": "19mg",
            "Phosphorus": "31mg",
            "Iron": "0.9mg",
            "Vitamin C": "2mg",
            "src": "https://www.nnc.gov.ph/regional-offices/mindanao/region-ix-zamboanga-peninsula/7081-the-benefits-of-lanzones-berry"
        },
        "preservation": {
            "jam": {
                "name": "Lanzones Jam",
                "description": "Indulge in the sweet and tropical flavors of lanzones preserved in a delightful jam. This spread captures the unique taste of lanzones, balancing sweetness and tartness. Enjoy it on toast, pastries, or as a delightful accompaniment to your favorite desserts.",
                "ingredients": [
                    "300g lanzones",
                    "2-3 tablespoons of brown sugar"
                ],
                "process": [
                    "Blend lanzones until a smooth consistency is achieved.",
                    "Heat a medium-sized pan over medium heat, and pour the blended langsat into it. Continuously stir and let it simmer until half of the moisture evaporates.",
                    "Add 2-3 tablespoons of brown sugar, stirring until the sugar caramelizes and the mixture thickens.",
                    "Transfer the jam to an airtight jar and store it in the refrigerator."
                ],
                "src": "https://www.facebook.com/WeRCSAW/photos/a.114348806639149/694017708672253/"
            },
            "cake": {
                "name": "Lanzones Cheesecake",
                "description": "Experience a decadent twist with Lanzones Cheesecake, where the creamy richness of cheesecake meets the exotic essence of lanzones.",
                "ingredients": [
                    "1kg cream cheese",
                    "225g sugar",
                    "310g sour cream",
                    "200g eggs, beaten",
                    "40g cornstarch",
                    "2 pcs lemon zest",
                    "15g vanilla extract",
                    "500g mango puree",
                    "100g mango jam",
                    "1 cup of ripe mango, cubed",
                    "1 cup of lanzones, peeled",
                    "200g chocolate biscuits with no filling",
                    "50g granulated sugar",
                    "114g unsalted butter"
                ],
                "process": [
                    "Preheat the oven to 180 degrees Celsius for the crust.",
                    "Crush biscuits until coarse.",
                    "Stir in sugar.",
                    "Combine with melted butter until crumbs are moistened.",
                    "Press the mixture into the bottom and sides of a springform pan.",
                    "Chill for at least an hour before baking in a 180-degree Celsius oven for 15 minutes to set the crust.",
                    "Preheat the oven to 160 degrees Celsius for the filling.",
                    "Beat cream cheese with sugar until fluffy.",
                    "Combine sour cream and beaten eggs.",
                    "Stir some of the sour cream mixture into cornstarch to form a slurry.",
                    "Mix the slurry into the remaining sour cream mixture and add to the cream cheese batter.",
                    "Fold in the slurry.",
                    "Fold in lemon zest and vanilla extract.",
                    "Bake in a springform pan with the baked crust for 40 minutes or until fully set.",
                    "Chill in the refrigerator for at least 6 hours before demolding.",
                    "For the topping, bring mango puree to a boil and whisk in mango jam. Off the heat, stir in cubed mangoes and lanzones segments once cooled.",
                    "Allow the topping to cool to about 30 degrees Celsius before placing it on top of the cheesecake.",
                    "Do not cook the lanzones and mangoes on the heat to preserve their flavor and structure."
                ],
                "src": "https://tastesetters.ph/?osetin_recipe=mango-and-lanzones-cheesecake"
            }
        }
    },
    "mangosteen": {
        "name": "Mangosteen",
        "iconName": "Mangosteen",
        "binomial": "Garcinia mangostana",
        "type": "Fruit",
        "season": ["August", "September", "October"],
        "nutrients": {
            "Calories": "73",
            "Protein": "0.41g",
            "Fat": "0.58g",
            "Carbohydrates": "17.9g",
            "Fiber": "1.8g",
            "Calcium": "12mg",
            "Iron": "0.3mg",
            "Magnesium": "13mg",
            "Phosphorus": "8mg",
            "Potassium": "48mg",
            "Sodium": "7mg",
            "Vitamin C": "2.9mg",
            "src": "https://fdc.nal.usda.gov/fdc-app.html#/food-details/169090/nutrients"
        },
        "preservation": {
            "vinegar": {
                "name": "Mangosteen Vinegar",
                "description": "A tangy and fruity vinegar infused with the unique flavor of mangosteen, perfect for adding a burst of exotic taste to salads and dressings.",
                "ingredients": [
                    "1/2kg of mangosteen",
                    "1/2 cup and 2 tablespoons of sugar",
                    "Water"
                ],
                "process": [
                    "Combine mangosteens and sugar in a spacious glass jar, adding just enough water to cover the fruit. Mix thoroughly.",
                    "Cover the jar opening with cheesecloth or a doubled-up thin Kerala towel, securing it with a rubber band.",
                    "Stir the mixture daily for a week to 10 days, observing signs of fermentation like bubbling and the release of carbon dioxide.",
                    "If fermentation is insufficient, consider adding a small amount of raw whey from yogurt to aid the process.",
                    "Monitor for any unusual signs like excessive bubbling, mold, unpleasant odors, or slimy liquid, and discard if needed.",
                    "Taste the liquid after 10 days; it should be sour with a hint of sweetness. Add more sugar if necessary.",
                    "Strain out and discard solids after 10 days, returning the liquid to the jar for further vinegar fermentation with a loose cap.",
                    "Check the vinegar every 2 weeks for about 3-4 months, ensuring it develops acidity without bitterness or mold.",
                    "Look for the formation of a mother (thickening) in the jar; strain it out and bottle the vinegar, keeping the mother for future batches.",
                    "If the mother is minimal, leave the brew as is.",
                    "Use the vinegar immediately or age it for enhanced flavors over a year or more.",
                    "Use the mother to start a new batch or share it as a starter for others."
                ],
                "src": "https://www.paticheri.com/2022/09/13/mangosteen-tropical-fruit-vinegars/"
            },
            "popsicle": {
                "name": "Mangosteen Popsicle",
                "description": "Cool down with refreshing popsicles made from the sweet and juicy pulp of mangosteen, a delightful tropical treat on a hot day.",
                "ingredients": [
                    "2 cans of full fat coconut milk",
                    "2-3 medjool dates",
                    "2-3 cups of mangosteen juice",
                    "2 tablespoons of coconut butter"
                ],
                "process": [
                    "Soften dates by pouring boiling water over them in a small bowl and letting them soak for about 10 minutes.",
                    "While dates are soaking, heat coconut milk and coconut butter over low to medium heat. Remove excess water from the softened dates and add them to the coconut mixture. Simmer for 5-10 minutes until dates dissolve. Strain the mixture through a sieve into a measuring cup.",
                    "For the popsicles, fill each mold with 1/3 mango juice and top it off with the coconut milk mixture. Place the molds in the freezer for 30-40 minutes before inserting wooden sticks. Freeze for an additional 2 hours before serving."
                ],
                "src": "https://delight-fuel.com/2019/07/25/healthy-mangosteen-popsicles/"
            },
            "juice": {
                "name": "Mangosteen Smoothie",
                "description": "Blend up a luscious smoothie featuring the rich and tropical taste of mangosteen, a healthy and delicious way to enjoy this exotic fruit.",
                "ingredients": [
                    "3 mangosteens",
                    "250ml of coconut drink"
                ],
                "process": [
                    "Open and deseed mangosteens by scoring the outer shell, prying it off, and discarding it. Separate the segments and cut around the central seed, removing it if necessary.",
                    "Place the prepared mangosteen in a blender and add coconut milk drink. Be cautious with additional fruits, as they may overpower the delicate mangosteen flavor. Coconut milk pairs well with mangosteen, or you can explore combinations with longans, rambutans, and dragon fruit for a subtle taste. For bolder options, consider bananas, passion fruit, pineapple, or papaya.",
                    "Blend until smooth, and savor your delightful tropical mangosteen smoothie!"
                ],
                "src": "https://foodaciously.com/recipe/mangosteen-smoothie"
            }
        }
    },
    "soursop": {
        "name": "Soursop (Guyabano)",
        "iconName": "Soursop",
        "binomial": "Annona muricata",
        "type": "Fruit",
        "season": ["August", "September", "October", "November"],
        "nutrients": {
            "Calories": "148",
            "Fat": "0.7g",
            "Sodium": "31.5mg",
            "Carbohydrates": "37.8g",
            "Fiber": "7.4g",
            "Sugar": "30.5g",
            "Protein": "2.3g",
            "Vitamin C": "46.4mg",
            "Potassium": "626mg",
            "src": "https://www.verywellfit.com/soursop-nutrition-facts-4687162"
        },
        "preservation": {
            "juice": {
                "name": "Soursop Juice",
                "description": "A refreshing beverage made from the pulpy, tangy-sweet flesh of the soursop fruit, known for its tropical flavor and potential health benefits.",
                "ingredients": [
                    "880g of ripe soursop",
                    "1 teaspoon of lime juice",
                    "2.5 cups of water",
                    "35g of sugar"
                ],
                "process": [
                    "Wash, peel, and core the soursop.",
                    "Place the pulp in a large bowl, adding water.",
                    "Squeeze or mash the soursop pulp for juice extraction.",
                    "Strain to separate juice from the pulp.",
                    "Sweeten to taste and add lime juice."
                ],
                "src": "https://jamaicanfoodsandrecipes.com/refreshing-soursop-juice-recipe/"
            },
            "drying": {
                "name": "Dried Soursop",
                "description": "Soursop slices or chunks dehydrated to create a chewy, concentrated snack, preserving the unique taste of the soursop fruit in a convenient form.",
                "ingredients": [
                    "1kg of soursop",
                    "500g granulated sugar",
                    "5ml vanilla"
                ],
                "process": [
                    "Wash the peeled soursop thoroughly, removing any remaining peels by rinsing with clean water.",
                    "Tear the soursop into thin threads. If desired, squeeze out the seeds or leave them whole. Use a spoon to remove seeds for a seedless option.",
                    "Marinate 500g of soursop with sugar. Optionally, add vanilla or sweetened condensed milk for additional flavor. Adjust sugar if condensed milk is added. Let it marinate for at least 1 hour, allowing the sugar to dissolve and permeate the soursop.",
                    "Once the sugar has dissolved, place the marinated soursop in a large saucepan.",
                    "Heat on low until the water evaporates, stirring with a spatula to prevent sticking.",
                    "Continue until the soursop turns ivory-white and clear. Turn off the heat.",
                    "Spread the soursop jam thinly on a tray.",
                    "Dry the jam by placing it in the sun or using a food dehydrator.",
                    "Once completely dry, individually wrap portions of the dried soursop in cellophane to prevent sticking. This makes it easier to handle due to its sticky nature."
                ],
                "src": "https://luonggiacompany.com/en/how-to-make-dried-soursop-at-home/"
            },
            "jam": {
                "name": "Soursop Jam",
                "description": "A delightful spread crafted from soursop pulp, sugar, and sometimes other complementary ingredients, offering a sweet and tropical twist to your toast or desserts.",
                "ingredients": [
                    "Soursop pulp",
                    "Water",
                    "6 green cardamom pod seeds",
                    "2 tablespoons of sugar (adjust to taste)",
                    "Zest and juice of 2 limes"
                ],
                "process": [
                    "Combine equal amounts of soursop pulp and water to create a textured cream. For a smoother consistency, pass through a food mill or sieve.",
                    "To 2 cups of the soursop cream, add the seeds of 6 green cardamom pods and 2 tablespoons of sugar.",
                    "Blend the mixture, being cautious with the sugar. Add sugar by the tablespoonful to avoid overdoing it.",
                    "Set on low heat and cook until the mixture begins to bubble. Taste and adjust sweetness as needed.",
                    "When the mixture bubbles, remove it from heat to avoid splattering. Stir in finely grated zest and juice of 2 limes.",
                    "Allow the mixture to cool.",
                    "Enjoy the soursop cream on toast, by the spoonful, over ice cream, or any way you prefer."
                ],
                "src": "https://www.kitchenbutterfly.com/2016/soursop-jam/"
            }
        }
    },
    "bitter_gourd": {
        "name": "Bitter Gourd (Ampalaya)",
        "iconName": "Bitter Gourd",
        "binomial": "Momordica charantia",
        "type": "Vegetable",
        "season": [],
        "nutrients": {
            "Calories": "24",
            "Fat": "0.2g",
            "Sodium": "392mg",
            "Carbohydrates": "5.4g",
            "Fiber": "2.5g",
            "Sugar": "2.4g",
            "Protein": "1g",
            "Potassium": "395.6mg",
            "Magnesium": "19.8mg",
            "Vitamin C": "40.9mg",
            "Folate": "63.2mcg",
            "src": "https://www.verywellfit.com/bitter-melon-nutrition-facts-4178970"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "sweet_potato": {
        "name": "Sweet Potato (Kamote)",
        "iconName": "Sweet Potato",
        "binomial": "Ipomoea batatas",
        "type": "Vegetable",
        "season": [],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "chayote": {
        "name": "Chayote (Sayote)",
        "iconName": "Chayote",
        "binomial": "Sechium edule",
        "type": "Vegetable",
        "season": ["January", "February, March", "May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "eggplant": {
        "name": "Eggplant (Talong)",
        "iconName": "Eggplant",
        "binomial": "Solanum melongena",
        "type": "Vegetable",
        "season": [],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "lettuce": {
        "name": "Lettuce (Letsugas)",
        "iconName": "Lettuce",
        "binomial": "Lactuca sativa",
        "type": "Vegetable",
        "season": ["January", "February, March", "April", "May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "okra": {
        "name": "Okra",
        "iconName": "Okra",
        "binomial": "Abelmoschus esculentus",
        "type": "Vegetable",
        "season": ["January", "April", "May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "sponge_gourd": {
        "name": "Sponge Gourd (Patola)",
        "iconName": "Sponge Gourd",
        "binomial": "Luffa aegyptiaca",
        "type": "Vegetable",
        "season": ["January", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "bok_choy": {
        "name": "Bok Choy (Pechay)",
        "iconName": "Bok Choy",
        "binomial": "Brassica rapa subsp. chinensis",
        "type": "Vegetable",
        "season": ["January", "February, March", "April", "May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "sili": {
        "name": "Sili",
        "iconName": "Sili",
        "binomial": "Capsicum annum",
        "type": "Vegetable",
        "season": ["January", "April", "May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "tomato": {
        "name": "Tomato (Kamatis)",
        "iconName": "Tomato",
        "binomial": "Solanum lycopersicum L.",
        "type": "Vegetable",
        "season": ["January", "March", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "16",
            "Fat": "0.2g",
            "Sodium": "5mg",
            "Carbohydrates": "3.5g",
            "Fiber": "1.1g",
            "Sugar": "2.4g",
            "Protein": "0.8g",
            "Vitamin C": "12.5mg",
            "Vitamin K": "7.2mg",
            "Potassium": "215.7mg",
            "Vitamin A": "38.2mcg",
            "Folate": "13.7mcg",
            "Beta carotene": "408.6mcg",
            "Lycopene": "2341.4mcg",
            "Vitamin E": "0.5mg",
            "src": "https://www.verywellfit.com/tomatoes-nutrition-facts-calories-and-health-benefits-4119981"
        },
        "preservation": {
            "powdering": {
                "name": "Tomato Powder",
                "description": "Preserving tomatoes by making tomato powder involves dehydrating ripe tomatoes and grinding them into a fine powder. This process intensifies the tomatoes' flavor and allows for easy storage. The resulting powder can be used as a versatile seasoning, adding a rich tomato taste to soups, sauces, and various dishes.",
                "ingredients": [
                    "Fresh tomatoes"
                ],
                "process": [
                    "Dry the tomatoes by sun-drying or by using a dehydrator.",
                    "Freeze the dried tomates for about a week to ensure any bug eggs that may be hiding in the tomatoes to be killed off.",
                    "Remove the frozen tomatoes from the freezer and grind them up using a blender.",
                    "Transfer the powderized tomatoe into a glass container with an airtight lid.",
                    "Store in a cool place, away from direct sunlight."
                ],
                "src": "https://freshbitesdaily.com/tomato-powder/?utm_content=bufferd5488&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer"
            },
            "canning": {
                "name": "Canning",
                "description": "",
                "ingredients": [
                    "Fresh tomatoes"
                ],
                "process": [
                    "Dry the tomatoes by sun-drying or by using a dehydrator."
                ],
                "src": "https://www.thespruceeats.com/how-to-can-tomatoes-p2-2216509"
            },
            "freezing": {
                "name": "Freezing",
                "description": "",
                "ingredients": [
                    "Fresh tomatoes"
                ],
                "process": [
                    "Dry the tomatoes by sun-drying or by using a dehydrator."
                ],
                "src": "https://www.thespruceeats.com/how-to-freeze-tomatoes-2217649"
            },
            "drying": {
                "name": "Drying",
                "description": "",
                "ingredients": [
                    "Fresh tomatoes"
                ],
                "process": [
                    "Dry the tomatoes by sun-drying or by using a dehydrator."
                ],
                "src": "https://www.thespruceeats.com/oven-dried-tomatoes-recipe-2217296"
            },
            "paste": {
                "name": "Tomato Paste",
                "description": "",
                "ingredients": [
                    "Fresh tomatoes"
                ],
                "process": [
                    "Dry the tomatoes by sun-drying or by using a dehydrator."
                ],
                "src": "https://www.thespruceeats.com/easy-homemade-tomato-paste-recipe-2216043"
            }
        }
    },
    "bottle_gourd": {
        "name": "Bottle Gourd (Upo)",
        "iconName": "Bottle Gourd",
        "binomial": "Lagenaria siceraria",
        "type": "Vegetable",
        "season": ["January", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "mustard_greens": {
        "name": "Mustard Greens (Mustasa)",
        "iconName": "Mustard Greens",
        "binomial": "Brassica juncea",
        "type": "Vegetable",
        "season": ["January"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "cauliflower": {
        "name": "Cauliflower",
        "iconName": "Cauliflower",
        "binomial": "Brassica oleracea var. botrytis",
        "type": "Vegetable",
        "season": ["January"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "onion": {
        "name": "Onion (Sibuyas)",
        "iconName": "Onion",
        "binomial": "Allium cepa",
        "type": "Vegetable",
        "season": ["January", "February, March", "April", "May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "cabbage": {
        "name": "Cabbage (Repolyo)",
        "iconName": "Cabbage",
        "binomial": "Brassica oleracea var. capitata",
        "type": "Vegetable",
        "season": ["January"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "ginger": {
        "name": "Ginger (Luya)",
        "iconName": "Ginger",
        "binomial": "Zingiber officinale",
        "type": "Vegetable",
        "season": [],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "garlic": {
        "name": "Garlic (Bawang)",
        "iconName": "Garlic",
        "binomial": "Allium sativum",
        "type": "Vegetable",
        "season": ["January", "February", "March", "April", "May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "mung_bean": {
        "name": "Mung Bean (Mongo)",
        "iconName": "Mung Bean",
        "binomial": "Vigna radiata",
        "type": "Vegetable",
        "season": ["January", "February", "April", "May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "winged_bean": {
        "name": "Winged Bean (Sigarilyas)",
        "iconName": "Winged Bean",
        "binomial": "Psophocarpus tetragonolobus",
        "type": "Vegetable",
        "season": ["February", "May", "April", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "squash": {
        "name": "Squash (Kalabasa)",
        "iconName": "Squash",
        "binomial": "Cucurbita maxima",
        "type": "Vegetable",
        "season": ["February", "April", "May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "lima_bean": {
        "name": "Lima Bean (Patani)",
        "iconName": "Lima Bean",
        "binomial": "Phaseolus lunatus",
        "type": "Vegetable",
        "season": ["May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "hyacinth_bean": {
        "name": "Hyacinth Bean (Bataw)",
        "iconName": "Hyacinth Bean",
        "binomial": "Lablab purpureus",
        "type": "Vegetable",
        "season": ["May", "June"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "long_bean": {
        "name": "Long Bean (Sitaw)",
        "iconName": "Long Bean",
        "binomial": "Vigna unguiculata ssp. sesquipedalis",
        "type": "Vegetable",
        "season": ["May", "June", "September", "October", "November", "December"],
        "nutrients": {
            "Calories": "110",
            "Carbohydrates": "28g",
            "Protein": "1g",
            "Fat": "0g",
            "Sugar": "15g",
            "Fiber": "3g",
            "Potassium": "450g",
            "src": "https://www.hsph.harvard.edu/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "moringa": {
        "name": "Moringa (Malunggay)",
        "iconName": "Moringa",
        "binomial": "Moringa oleifera",
        "type": "Vegetable / Herb",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "pandan": {
        "name": "Pandan",
        "iconName": "Pandan",
        "binomial": "Pandanus amaryllifolius",
        "type": "Herb",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "turmeric": {
        "name": "Turmeric",
        "iconName": "Turmeric",
        "binomial": "Curcuma longa",
        "type": "Vegetable / Spice",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "oregano": {
        "name": "Oregano",
        "iconName": "Oregano",
        "binomial": "Origanum vulgare",
        "type": "Herb",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    },
    "lemongrass": {
        "name": "Lemongrass (Tanglad)",
        "iconName": "Lemongrass",
        "binomial": "Cymbopogon",
        "type": "Vegetable / Herb",
        "season": [],
        "nutrients": {
            "Calories": "187",
            "Carbohydrates": "7g",
            "Protein": "2g",
            "Fat": "16.2g",
            "Sugar": "2.1g",
            "Fiber": "4.6g",
            "src": "https://www.everydayhealth.com/diet-nutrition/diet/coconut-nutrition-facts-health-benefits-beauty-benefits-recipes/"
        },
        "preservation": {
            "": {
                "name": "",
                "description": "",
                "ingredients": [
                    ""
                ],
                "process": [
                    ""
                ],
                "src": ""
            }
        }
    }
}